EcSUHA/ESP32_DeVICE_Module/ESP32_DeVICE_Module.c
/* #################################################################################################
 *
 *  Function: ESP32_DeVICE Module for SCDE (Smart Connected Device Engine)
 *
 *  DeVICE -> DeVICE Feature
 *
 *  It is used to control an IoT Device (ESP32 - SoC and OS) that runs the SCDE 
 *  (Smart Connected Device Engine)
 *
 *  ESP 8266EX & ESP32 SOC Activities ...
 *  Copyright by EcSUHA
 *
 *  Created by Maik Schulze, Sandfuhren 4, 38448 Wolfsburg, Germany for EcSUHA.de 
 *
 *  MSchulze780@GMAIL.COM
 *  Copyright by EcSUHA
 *
 *  EcSUHA - ECONOMIC SURVEILLANCE AND HOME AUTOMATION - WWW.EcSUHA.DE
 * #################################################################################################
 */

/*
define xyz ESP32_DeVICE Name=maik&WSAP_Password=pw&WSAP_RF_Channel=1&WSAP_Maximal_Connections=3&WSAP_Authentication_Method=WPA2_PSK
define xyz 

*/

// Daten:
// 1. define (commmon/specific)
// 2. Attribute (Name/Content)
// 3. Readings (Time/data/Content)

// define myname Module Key&Values die direkt ins define gehen 
//    nicht sinvoll -> + Readings mit intialen Werten + Attribute mit initialen Werten 

// set myname + Readings mit Werten

// attr myname + Attribute mit Werten

#include <ProjectConfig.h>
#include <esp8266.h>
#include <Platform.h>



// the Smart-Connected-Device-Engine structures & types ...
#include <SCDE_s.h>

// provides WebIf, need the structures & types ...
#include "WebIf_Module.h"

// this Modules structures & types ...
#include "ESP32_DeVICE_Module.h"
#include "ESP32_SCDE_WEBIF_get_cb.h"






#include "freertos/event_groups.h"



// -------------------------------------------------------------------------------------------------

// set default build verbose - if no external override
#ifndef ESP32_DeVICE_Module_DBG  
#define ESP32_DeVICE_Module_DBG  5	// 5 is default
#endif 

// -------------------------------------------------------------------------------------------------

// set default build verbose - if no external override
#ifndef ESP32_SCDE_Module_DBG  
#define ESP32_SCDE_Module_DBG  5	// 5 is default
#endif 

// -------------------------------------------------------------------------------------------------




// FreeRTOS event group to signal when we are connected & ready to make a request
static EventGroupHandle_t wifi_event_group;

/* The event group allows multiple bits for each event,
 but we only care about one event - are we connected
 to the AP with an IP? */
static const int CONNECTED_BIT = BIT0;

// -------------------------------------------------------------------------------------------------



#include <WebIf_EspFSStdFileTX.h>
#include <WebIf_EspFSAdvFileTX.h>

#include "HTools_cgi.h"
#include <ServAPCfg_tpl.h>
#include <CGI_Redirect.h>





// -------------------------------------------------------------------------------------------------



/*
 * Implemented Values for Keys
 */

// ESP32_DeVICE_SET_SIG_OUT_EN -> 'SIG_OUT_EN' -> DISABLED|ENABLED
SelectAData ESP32_DeVICE_DisEn[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"DISABLED"},
  {1,"ENABLED"}, 
  {0, NULL}
};

// ESP32_DeVICE_SET_MAX_CONN -> 'MAX_CONN' -> 1|2|3|4|5
SelectAData ESP32_DeVICE_MAX_CONN[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"1"},
  {1,"2"},
  {2,"3"},
  {3,"4"},
  {4,"5"},
  {0, NULL}
};

// ESP32_DeVICE_SET_CHANNEL -> 'CHANNEL' -> CH_1|CH_2|CH_3|CH_4|CH_5|CH_6|CH_7|CH_8|CH_9|CH_10|CH_11|CH_12|CH_13|CH_14
SelectAData ESP32_DeVICE_CHANNEL[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {1,"CH_1"},
  {2,"CH_2"},
  {3,"CH_3"},
  {4,"CH_4"},
  {5,"CH_5"},
  {6,"CH_6"},
  {7,"CH_7"},
  {8,"CH_8"},
  {9,"CH_9"},
  {10,"CH_10"},
  {11,"CH_11"},
  {12,"CH_12"},
  {13,"CH_13"},
  {14,"CH_14"},
  {0, NULL}
};

// ESP32_DeVICE_SET_CHANNEL -> 'SSID' -> VISIBLE|HIDDEN
SelectAData ESP32_DeVICE_SSID_VISIBILITY[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"VISIBLE"},
  {1,"HIDDEN"},
  {0, NULL}
};

// ESP32_DeVICE_SET_AP -> 'AP' -> 1|2|3|4|5|6
SelectAData ESP32_DeVICE_AP[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"1"},
  {1,"2"},
  {2,"3"},
  {3,"4"},
  {4,"5"},
  {5,"6"},
  {0, NULL}
};

// ESP32_DeVICE_SET_PH_MODE -> 'PH_MODE' -> 802.11b|802.11g|802.11n
SelectAData ESP32_DeVICE_PH_MODE[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {1,"802.11b"},
  {2,"802.11g"},
  {3,"802.11n"},
  {0, NULL}
};

// ESP32_DeVICE_SET_WIFI_COUNTRY -> 'WIFI_COUNTRY' -> CN|JP|US|EU
SelectAData ESP32_DeVICE_WIFI_COUNTRY[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"CN"},
  {1,"JP"},
  {2,"US"},
  {3,"EU"},
  {0, NULL}
};

// ESP32_DeVICE_SET_AUTH_MODE -> 'AUTH_MODE' -> OPEN|WEP|WPA_PSK|WPA2_PSK|WPA_WPA2_PSK|WPA2_ENTERPRISE|MAX
SelectAData ESP32_DeVICE_AUTH_MODE[] = {  //authMode[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"OPEN"},
  {1,"WEP"},
  {2,"WPA_PSK"},
  {3,"WPA2_PSK"},
  {4,"WPA_WPA2_PSK"},
  {5,"WPA2_ENTERPRISE"},
  {6,"WPA3_PSK"},
  {0, NULL}
};

// ESP32_DeVICE_SET_WIFI_BANDWIDTH -> 'WIFI_BANDWIDTH' -> HT20|HT40|HT??
SelectAData ESP32_DeVICE_WIFI_BANDWIDTH[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"HT20"},
  {1,"HT40"},
  {2,"HT??"},
  {0, NULL}
};



//define xyz ESP32_DeVICE Name=maik&WSAP_Password=pw&WSAP_RF_Channel=1&WSAP_Maximal_Connections=3&WSAP_Authentication_Method=WPA2_PSK


/**
 * For Type: ESP32_DeVICE
 * Implemented-Keys (Args input via Key=value) for SetFn input (MAX 64!)
 * KEYs-Field-Set for Feature specific query. Will be generated by SCDEH_ParseStrToparsedKVInput()
 * parsed result is stored in ESP32_DeVICE_parsedKVInput_t
 */
enum ESP32_DeVICE_Set_IK {				// Bit #XX for debugging

  // Block 1 - func
    ESP32_DeVICE_Set_IK_Name		= 0				// Bit #00 'Name'						-> 
  , ESP32_DeVICE_Set_IK_WSAP_Password				// Bit #01 'WSAP_Password'				-> 
  , ESP32_DeVICE_Set_IK_WSAP_RF_Channel		        // Bit #02 'WSAP_RF_Channel' 			-> 
  , ESP32_DeVICE_Set_IK_WSAP_Maximal_Connections	// Bit #03 'WSAP_Maximal_Connections'  	-> 
  , ESP32_DeVICE_Set_IK_WSAP_Authentication_Method	// Bit #04 'WSAP_Authentication_Method' -> 
  , ESP32_DeVICE_Set_IK_WSAP_SSID_Visibility		// Bit #05 'WSAP_SSID'  				-> 
  , ESP32_DeVICE_Set_IK_WSAP_Beacon_Interval		// Bit #06 'WSAP_Beacon_Interval'  		-> 

   // Block 2 - func
  , ESP32_DeVICE_Set_IK_WSAP_IP_Adress				// Bit #07 'WSAP_IP_Adress'  		-> 
  , ESP32_DeVICE_Set_IK_WSAP_Netmask				// Bit #08 'WSAP_Netmask'  		-> 
  , ESP32_DeVICE_Set_IK_WSAP_Gateway_Adress			// Bit #09 'WSAP_Gateway_Adress'  	-> 

   // Block 3 - func
  , ESP32_DeVICE_Set_IK_WSAP_MAC_Adress		        // Bit #10 'WSAP_MAC_Adress'  		-> 

   // Block 4 - func
  , ESP32_DeVICE_Set_IK_WSAP_WiFi_Bandwidth			// Bit #11 'WSAP_WiFi_Bandwidth'	-> 

