EcSUHA/ESP32_DeVICE_Module/ESP32_DeVICE_Module.c
   // Block 5 - func
  , ESP32_DeVICE_Set_IK_WiFi_Country				// Bit #12 'WiFi_Country'		-> 

   // Block 6 - func
  , ESP32_DeVICE_Set_IK_Station_IP_Adress			// Bit #13 'Station_IP_Adress'  	-> 
  , ESP32_DeVICE_Set_IK_Station_Netmask		        // Bit #14 'Station_Netmask'  		-> 
  , ESP32_DeVICE_Set_IK_Station_Gateway_Adress		// Bit #15 'Station_Gateway_Adress'  	-> 

   // Block 7 - func
  , ESP32_DeVICE_Set_IK_Station_MAC_Adress			// Bit #16 'Station_MAC_Adress'		-> 

   // Block 8 - func
  , ESP32_DeVICE_Set_IK_Station_Auto_Connect		// Bit #17 'Station_Auto_Connect'	-> 

   // Block 9 - func
  , ESP32_DeVICE_Set_IK_Station_WiFi_Bandwidth		// Bit #18 'Station_WiFi_Bandwidth'	-> 






   // Block 3 - func
  , ESP32_DeVICE_Set_IK_WSAP_DHCPS_Lease_Start_IP	// Bit #10 'WSAP_DHCPS_Lease_Start_IP'  -> 
  , ESP32_DeVICE_Set_IK_WSAP_DHCPS_Lease_End_IP	    // Bit #11 'WSAP_DHCPS_Lease_End_IP'  	-> 

   // Block 4 - func
  , ESP32_DeVICE_Set_IK_WSAP_DHCPS					// Bit #12 'WSAP_DHCPS'  		-> 


   // Block 6 - func
  , ESP32_DeVICE_Set_IK_WSAP						// Bit #14 'WSAP'  			-> 


   // Block 8 - func
  , ESP32_DeVICE_Set_IK_Station			       		// Bit #18 'Station'  			-> 

   // Block 9 - func
  , ESP32_DeVICE_Set_IK_Station_DHCP				// Bit #19 'Station_DHCP'		-> 


   // Block 11 - func
  , ESP32_DeVICE_Set_IK_Station_Physical_Mode		// Bit #21 'Station_Physical_Mode'	-> 

   // Block 12 - func
  , ESP32_DeVICE_Set_IK_Station_Get_RSSI			// Bit #22 'Station_Get_RSSI'		-> 




   // Block 14 - func
  , ESP32_DeVICE_Set_IK_TiSt_NTP_Server_Main		// Bit #24 'TiSt_NTP_Server_Main'	-> 

   // Block 15 - func
  , ESP32_DeVICE_Set_IK_TiSt_NTP_Server_Backup_1	// Bit #25 'TiSt_NTP_Server_Backup_1'	-> 

   // Block 16 - func
  , ESP32_DeVICE_Set_IK_TiSt_NTP_Server_Backup_2	// Bit #26 'TiSt_NTP_Server_Backup_2'	-> 

   // Block 17 - func
  , ESP32_DeVICE_Set_IK_TiSt_Time_Zone				// Bit #27 'TiSt_Time_Zone'		-> 

   // Block 18 - func
  , ESP32_DeVICE_Set_IK_TiSt_Get_Time				// Bit #28 'TiSt_Get_Time'		-> 

   // Block xx - func
  , ESP32_DeVICE_Set_IK_SoCHW_Restart				// Bit #29 'SoCHW_Restart'		-> 

   // Block xx - func
  , ESP32_DeVICE_Set_IK_SoCHW_Factory_Reset_SCDE	// Bit #30 'SoCHW_Factory_Reset_SCDE'	-> 

   // Block xx - func
  , ESP32_DeVICE_Set_IK_SoCHW_Factory_Reset_CAPI	// Bit #31 'SoCHW_Factory_Reset_CAPI'	-> 

   // Block xx - func
  , ESP32_DeVICE_Set_IK_SoCHW_Factory_Reset			// Bit #32 'SoCHW_Factory_Reset'	-> 

   // helper to get number of implemented keys
  , ESP32_DeVICE_Set_NUMBER_OF_IK					// Bit #34 MAX 64 IMPLEMENTED !
};



/* For Type: ESP32_DeVICE
 * Implemented readings (MAX 32!)
 * Can be assigned to Implemented Keys, if affected
 */
enum ESP32_DeVICE_Readings {				 // Bit #XX for debugging
  // Internals - TiSt-Sharing - Block 1 - func
   ESP32_DeVICE_R_Name							= (1<<0) // Bit #01 'Name'			-> 
  ,ESP32_DeVICE_R_WSAP_Password					= (1<<1) // Bit #01 'WSAP_Password'		-> 
  ,ESP32_DeVICE_R_WSAP_RF_Channel				= (1<<2) // Bit #01 'WSAP_RF_Channel'		-> 
  ,ESP32_DeVICE_R_WSAP_Maximal_Connections		= (1<<3) // Bit #01 'WSAP_Maximal_Connections'	-> 
  ,ESP32_DeVICE_R_WSAP_Authentication_Method	= (1<<4) // Bit #01 'WSAP_Authentication_Method'-> 
  ,ESP32_DeVICE_R_WSAP_SSID_Visibility						= (1<<5) // Bit #01 'WSAP_SSID'			->
  ,ESP32_DeVICE_R_WSAP_Beacon_Interval			= (1<<6) // Bit #01 'WSAP_Beacon_Interval'	-> 

  // Internals - TiSt-Sharing - Block 2 - func
  ,ESP32_DeVICE_R_WSAP_IP_Adress				= (1<<7) // Bit #02 'WSAP_IP_Adress'		-> 
  ,ESP32_DeVICE_R_WSAP_Netmask					= (1<<8) // Bit #02 'WSAP_Netmask'		-> 
  ,ESP32_DeVICE_R_WSAP_Gateway_Adress			= (1<<9) // Bit #02 'WSAP_Gateway_Adress'	-> 

  // Internals - TiSt-Sharing - Block 3 - func
  ,ESP32_DeVICE_R_WSAP_MAC_Adress				= (1<<10) // Bit #04 'WSAP_MAC_Adress'		-> 

  // Internals - TiSt-Sharing - Block 4 - func
  ,ESP32_DeVICE_R_WSAP_WiFi_Bandwidth			= (1<<11) // Bit #07 'WSAP_WiFi_Bandwidth'	-> 

  // Internals - TiSt-Sharing - Block 5 - func
  ,ESP32_DeVICE_R_WiFi_Country					= (1<<12) // Bit #07 'WiFi_Country'		-> 

  // Internals - TiSt-Sharing - Block 6 - func
  ,ESP32_DeVICE_R_Station_IP_Adress				= (1<<13) // Bit #06 'Station_IP_Adress'	-> 
  ,ESP32_DeVICE_R_Station_Netmask				= (1<<14) // Bit #06 'Station_Netmask'		-> 
  ,ESP32_DeVICE_R_Station_Gateway_Adress		= (1<<15) // Bit #06 'Station_Gateway_Adress'	-> 

  // Internals - TiSt-Sharing - Block 7 - func
  ,ESP32_DeVICE_R_Station_MAC_Adress			= (1<<16) // Bit #11 'Station_MAC_Adress'	-> 

  // Internals - TiSt-Sharing - Block 8 - func
  ,ESP32_DeVICE_R_Station_Auto_Connect			= (1<<16) // Bit #09 'Station_Auto_Connect'	-> 

  // Internals - TiSt-Sharing - Block 9 - func
  ,ESP32_DeVICE_R_Station_WiFi_Bandwidth		= (1<<16) // Bit #07 'Station_WiFi_Bandwidth'	-> 






  // Internals - TiSt-Sharing - Block 3 - func
  ,ESP32_DeVICE_R_WSAP_DHCPS_Lease_Start_IP		= (1<<2) // Bit #03 'WSAP_DHCPS_Lease_Start_IP'	-> 
  ,ESP32_DeVICE_R_WSAP_DHCPS_Lease_End_IP		= (1<<2) // Bit #03 'WSAP_DHCPS_Lease_End_IP'	-> 
  ,ESP32_DeVICE_R_WSAP_DHCPS					= (1<<2) // Bit #03 'WSAP_DHCPS'		-> 


  // Internals - TiSt-Sharing - Block 5 - func
  ,ESP32_DeVICE_R_WSAP							= (1<<4) // Bit #05 'WSAP'			-> 


  // Internals - TiSt-Sharing - Block 7 - func
  ,ESP32_DeVICE_R_Station						= (1<<6) // Bit #07 'Station'			-> 

  // Internals - TiSt-Sharing - Block 8 - func
  ,ESP32_DeVICE_R_Station_DHCP					= (1<<7) // Bit #08 'Station_DHCP'		-> 


  // Internals - TiSt-Sharing - Block 10 - func
  ,ESP32_DeVICE_R_Station_Physical_Mode			= (1<<9) // Bit #10 'Station_Physical_Mode'	-> 


  // Internals - TiSt-Sharing - Block 12 - func
  ,ESP32_DeVICE_R_TiSt_NTP_Server_Main			= (1<<11) // Bit #12 'TiSt_NTP_Server_Main'	-> 
  ,ESP32_DeVICE_R_TiSt_NTP_Server_Backup_1		= (1<<11) // Bit #12 'TiSt_NTP_Server_Backup_1'	-> 
  ,ESP32_DeVICE_R_TiSt_NTP_Server_Backup_2		= (1<<11) // Bit #12 'TiSt_NTP_Server_Backup_2'	-> 
  ,ESP32_DeVICE_R_TiSt_Time_Zone				= (1<<11) // Bit #12 'TiSt_Time_Zone'		-> 


  // Readings - TiSt-Sharing - Block 1 - func
  ,ESP32_DeVICE_R_Station_RSSI					= (1<<12) // Bit #13 'Station_RSSI'		-> 
  ,ESP32_DeVICE_R_TiSt_Time						= (1<<12) // Bit #13 'TiSt_Time'		-> 

  ,ESP32_DeVICE_R_Namex							= (1<<13) // Bit #02 'name' + caps + ufid -> 
};























/* For: SCDE_cgi
 * Implemented KEYS and assigned readings for this query - analyzed by by http_parser_parse_url()
 * Num should meet enum XX_QueryFields
 * Result is stored in struct SCDE_XX_parsedKVInput
 */
kvParseImplementedKeys_t ESP32_DeVICE_Set_ImplementedKeys[] =
  {//affected_reading | affected_reading			|  CMD
  // Block 1 - func
   { ESP32_DeVICE_R_Name						, "Name" }			// #00
  ,{ ESP32_DeVICE_R_WSAP_Password				, "WSAP_Password" }		// #01
  ,{ ESP32_DeVICE_R_WSAP_RF_Channel				, "WSAP_RF_Channel" }		// #02
  ,{ ESP32_DeVICE_R_WSAP_Maximal_Connections	, "WSAP_Maximal_Connections" }	// #03
  ,{ ESP32_DeVICE_R_WSAP_Authentication_Method	, "WSAP_Authentication_Method" }// #04
  ,{ ESP32_DeVICE_R_WSAP_SSID_Visibility		, "WSAP_SSID" }			// #05
  ,{ ESP32_DeVICE_R_WSAP_Beacon_Interval		, "WSAP_Beacon_Interval" }	// #06

  // Block 2 - func
  ,{ ESP32_DeVICE_R_WSAP_IP_Adress				, "WSAP_IP_Adress" }		// #07
  ,{ ESP32_DeVICE_R_WSAP_Netmask				, "WSAP_Netmask" }		// #08
  ,{ ESP32_DeVICE_R_WSAP_Gateway_Adress			, "WSAP_Gateway_Adress" }	// #09

  // Block 3 - func
  ,{ ESP32_DeVICE_R_WSAP_MAC_Adress				, "WSAP_MAC_Adress" }		// #10

  // Block 4 - func
  ,{ ESP32_DeVICE_R_WSAP_WiFi_Bandwidth			, "WSAP_WiFi_Bandwidth" }	// #11

