EcSUHA/ESP32_DeVICE_Module/ESP32_DeVICE_Module.c
  // Block 5 - func
  ,{ ESP32_DeVICE_R_WiFi_Country				, "WiFi-Country" }		// #12

  // Block 6 - func
  ,{ ESP32_DeVICE_R_Station_IP_Adress			, "Station_IP_Adress" }		// #13
  ,{ ESP32_DeVICE_R_Station_Netmask				, "Station_Netmask" }		// #14
  ,{ ESP32_DeVICE_R_Station_Gateway_Adress		, "Station_Gateway_Adress" }	// #15

  // Block 7 - func
  ,{ ESP32_DeVICE_R_Station_MAC_Adress			, "Station_MAC_Adress" }	// #16

  // Block 8 - func
  ,{ ESP32_DeVICE_R_Station_Auto_Connect		, "Station_Auto_Connect" }	// #17

  // Block 9 - func
  ,{ ESP32_DeVICE_R_Station_WiFi_Bandwidth		, "Station_WiFi_Bandwidth" }	// #18









  // Block 3 - func
  ,{ ESP32_DeVICE_R_WSAP_DHCPS_Lease_Start_IP	, "WSAP_DHCPS_Lease_Start_IP" }	// #10
  ,{ ESP32_DeVICE_R_WSAP_DHCPS_Lease_End_IP		, "WSAP_DHCPS_Lease_End_IP" }	// #11

  // Block 4 - func
  ,{ ESP32_DeVICE_R_WSAP_DHCPS					, "WSAP_DHCPS" }		// #12

  // Block 6 - func
  ,{ ESP32_DeVICE_R_WSAP						, "WSAP" }			// #14

  // Block 8 - func
  ,{ ESP32_DeVICE_R_Station						, "Station" }			// #18

  // Block 9 - func
  ,{ ESP32_DeVICE_R_Station_DHCP				, "Station_DHCP" }		// #19

  // Block 11 - func
  ,{ ESP32_DeVICE_R_Station_Physical_Mode		, "Station_Physical_Mode" }	// #21

  // Block 12 - func
  ,{ ESP32_DeVICE_R_Station_RSSI				, "Station_Get_RSSI" }		// #22

   // Block 14 - func
  ,{ ESP32_DeVICE_R_TiSt_NTP_Server_Main		, "TiSt_NTP_Server_Main" }	// #24

  // Block 15 - func
  ,{ ESP32_DeVICE_R_TiSt_NTP_Server_Backup_1	, "TiSt_NTP_Server_Backup_1" }	// #25

  // Block 16 - func
  ,{ ESP32_DeVICE_R_TiSt_NTP_Server_Backup_2	, "TiSt_NTP_Server_Backup_2" }	// #26

  // Block 17 - func
  ,{ ESP32_DeVICE_R_TiSt_Time_Zone				, "TiSt_Time_Zone" }		// #27

  // Block 18 - func
  ,{ ESP32_DeVICE_R_TiSt_Time					, "TiSt_Get_Time" }		// #28

  // Block 18 - func
  ,{ 0											, "SoCHW_Restart" }		// #29

  // Block 18 - func
  ,{ 0											, "SoCHW_Factory_Reset_SCDE" }	// #30

  // Block 18 - func
  ,{ 0											, "SoCHW_Factory_Reset_CAPI" }	// #31

 // Block 18 - func
  ,{ 0											, "SoCHW_Factory_Reset" }	// #32

}; // !!! number of implemented keys should be equal with XX_IK_Number_of_keys, LIMIT IS 64 ELEMENTS !!!











/**
 * -------------------------------------------------------------------------------------------------
 *  DName: ESP32_DeVICE_ActiveResourcesDataA_forWebIf
 *  Desc: Resource-Content-structure of active Directory - PART A (Resource-Data-Row)
 *  Data: WebIf_ActiveResourcesDataA_t[X] from HttpD.h
 * -------------------------------------------------------------------------------------------------
 */
// Content:   AllowedMethodBF          | AllowedDocMimeBF  | AllowedSchemeBF |free|CgiNo| EnaByBit | Url
const WebIf_ActiveResourcesDataA_t ESP32_DeVICE_ActiveResourcesDataA_forWebIf[] = {

// Multi SCDE(es)-Feature Control
  // GET http://192.168.0.24:80/SCDE .htm oder .jso
  // POST http://192.168.0.24:80/SCDE .htm oder .jso
  { 0b00000000000000000000000000001010, 0b0000000000001010, 0b0000000000000001,     0,    3, 0b00000000, "/SCDE"},

  // SCDE-Feature Control (http + http compatibility resources incl. method compatibility mode) - adressing by seq. no. of definition (from this TYPE)
  // GET http://192.168.0.24:80/3 .htm, .cgi, .jso, .set oder .get
  // POST http://192.168.0.24:80/3 .htm, .cgi, .jso, .set oder .get
  { 0b00000000000000000000000000001010, 0b0000000001011110, 0b0000000000000001,     0,    1, 0b00000000, "/\xf1/SCDE\x00 /SCDEX.htm"},

  // SCDE-Feature Control (http + http compatibility resources incl. method compatibility mode) - adressing by NAME
  // GET http://192.168.0.24:80/SSR.1.at.GPIO.13 .htm, .cgi, .jso, .set oder .get
  // POST http://192.168.0.24:80/SSR.1.at.GPIO.13 .htm, .cgi, .jso, .set oder .get
  { 0b00000000000000000000000000001010, 0b0000000001011110, 0b0000000000000001,     0,    1, 0b00000000, "/\xf3\x00 /SCDEX.htm"},

// SCDE-Feature Control (Home Automation scheme SCDE incl. method compatibility mode) - adressing by seq. no. of definition (from this TYPE)
  // GET scde://192.168.0.24:80/3                     SCDE-Feature-No.     Control - Home Automation Scheme SCDE:// access Resources
  { 0b00000000000000000000000000000010, 0b0000000000000001, 0b0000000000000010,     0,    1, 0b00000000, "/\xf1\x00\x08"},
  // SET scde://192.168.0.24:80/3                     SCDE-Feature-No.     Control - Home Automation Scheme SCDE:// access Resources
  { 0b00000000000000000000000000000100, 0b0000000000000001, 0b0000000000000010,     0,    2, 0b00000000, "/\xf1\x00\x08"},
    // kompatibilität - nötig ?
    // GET scde://192.168.0.24:80/3.get                 SCDE-Feature-No.     Control - Home Automation Scheme SCDE:// access Resources
    { 0b00000000000000000000000000000010, 0b0000000001000000, 0b0000000000000010,   0,    1, 0b00000000, "/\xf1\x00\x08"},
    // GET scde://192.168.0.24:80/3.set                 SCDE-Feature-No.     Control - Home Automation Scheme SCDE:// access Resources
    { 0b00000000000000000000000000000010, 0b0000000000010000, 0b0000000000000010,   0,    1, 0b00000000, "/\xf1\x00\x08"},

//SCDE-Feature Control (Home Automation scheme SCDE incl. method compatibility mode) - adressing by NAME
  // GET scde://192.168.0.24:80/SSR.1.at.GPIO.13      RENAMED SCDE-Feature Control - Home Automation SCDE:// access Resources
  { 0b00000000000000000000000000000010, 0b0000000000000001, 0b0000000000000010,     0,    1, 0b00000000, "/\xf3\x00\x08"},
  // SET scde://192.168.0.24:80/SSR.1.at.GPIO.13      RENAMED SCDE-Feature Control - Home Automation SCDE:// access Resources
  { 0b00000000000000000000000000000100, 0b0000000000000001, 0b0000000000000010,     0,    2, 0b00000000, "/\xf3\x00\x08"},
    // kompatibilität - nötig ?
    // GET scde://192.168.0.24:80/SSR.1.at.GPIO.13.get  RENAMED SCDE-Feature Control - Home Automation SCDE:// access Resources
    { 0b00000000000000000000000000000010, 0b0000000001000000, 0b0000000000000010,   0,    1, 0b00000000, "/\xf3\x00\x08"},
    // GET scde://192.168.0.24:80/SSR.1.at.GPIO.13.set  RENAMED SCDE-Feature Control - Home Automation SCDE:// access Resources
    { 0b00000000000000000000000000000010, 0b0000000000010000, 0b0000000000000010,   0,    1, 0b00000000, "/\xf3\x00\x08"},


// old stuff

  // SOC Hardware Cfg
  { 0b00000000000000000000000000001010, 0b0000000000001110, 0b0000000000000001,  0,  4, 0b00000000, "/SoCHWCfg"}

  // WiFi Stations Cfg
 ,{ 0b00000000000000000000000000001010, 0b0000000000001110, 0b0000000000000001,  0,  5, 0b00000000, "/WiFi/StationCfg"}

  // WIFI Q-Connect PAGES
 ,{ 0b00000000000000000000000000001010, 0b0000000000000010, 0b0000000000000001,  0,  6, 0b00000000, "/WiFi/QConnect"}
 ,{ 0b00000000000000000000000000001010, 0b0000000000001000, 0b0000000000000001,  0,  7, 0b00000000, "/WiFi/WiFiScan"}
 ,{ 0b00000000000000000000000000001010, 0b0000000000000100, 0b0000000000000001,  0,  8, 0b00000000, "/WiFi/Connect"}
 ,{ 0b00000000000000000000000000001010, 0b0000000000000100, 0b0000000000000001,  0,  9, 0b00000000, "/WiFi/Setmode"}

  // Service Access Point Cfg
 ,{ 0b00000000000000000000000000001010, 0b0000000000001110, 0b0000000000000001,  0, 10, 0b00000000, "/WiFi/ServAPCfg"}

  // TimeStamp Cfg
 ,{ 0b00000000000000000000000000001010, 0b0000000000001110, 0b0000000000000001,  0, 11, 0b00000000, "/TiStCfg"}

  // Firmware Update
 ,{ 0b00000000000000000000000000001010, 0b0000000000001110, 0b0000000000000001,  0, 12, 0b00000000, "/Firmware"}

  // Redirects
 ,{ 0b00000000000000000000000000001010, 0b0000000000000001, 0b0000000000000001,  0, 13, 0b00000000, "/WiFi"}	// nomime
 ,{ 0b00000000000000000000000000001010, 0b0000000000000001, 0b0000000000000001,  0, 13, 0b00000000, "/WiFi/"}	// nomime
 ,{ 0b00000000000000000000000000001010, 0b0000000000000001, 0b0000000000000001,  0, 14, 0b00000000, "/"}	// nomime
 ,{ 0b00000000000000000000000000001010, 0b0000000000000010, 0b0000000000000001,  0, 14, 0b00000000, "/index"}	// .htm

