EcSUHA/ESP32_DeVICE_Module/ESP32_DeVICE_Module.c
  // Secret services
 ,{ 0b00000000000000000000000000001010, 0b0000000000100000, 0b0000000000000001,  0, 15, 0b00000000, "/32MBitFlash"}
 ,{ 0b00000000000000000000000000001010, 0b0000000000100000, 0b0000000000000001,  0, 16, 0b00000000, "/wfs"}

 ,{0,0,0,0,0,0,"*"}
};



/**
 * -------------------------------------------------------------------------------------------------
 *  DName: ESP32_DeVICE_ActiveResourcesDataB_forWebIf
 *  Desc: Resource-Content-structure of active Directory - PART B (Procedure-Call-Data-Row) 
 *  Data: WebIf_ActiveResourcesDataB_t[X] from HttpD.h
 * -------------------------------------------------------------------------------------------------
 */
// CgiFucID=(No.<<16)+AllowedSchemeBF |      cgi            |     cgi_data
const WebIf_ActiveResourcesDataB_t ESP32_DeVICE_ActiveResourcesDataB_forWebIf[] =  {

  // SCDE-Definition-Feature Control
//  {(1<<16) +	0b0000000000000010,    WebIf_EspFSAdvFileTX, ESP32_SCDEtpl },
//  {(1<<16) +	0b0000000000000100,    ESP32_SCDE_cgi,    	NULL },
//  {(1<<16) +	0b0000000000001001,    ESP32_SCDE_jso,     	NULL }, // ohne, .jso,
  {(1<<16) +	0b0000000001000000,    ESP32_SCDE_WEBIF_get,	NULL }, // experimental .get
//  {(1<<16) +	0b0000000000010000,    ESP32_SCDE_set,   	NULL },
//  {(2<<16) +	0b0000000000010001,    ESP32_SCDE_set,    	NULL }, // Ergänzung für .set ,2 ohne mime

  // SCDE-Module-Feature Control (All SCDE(es)-Feature Control)
//  {(3<<16) +	0b0000000000000010,    WebIf_EspFSAdvFileTX, ESP32_SCDE_tpl },
//  {(3<<16) +	0b0000000000001000,    ESP32_SCDE_jso,     NULL }


// old stuff

  // ### SOC Hardware Cfg ###
  {( 4<<16) +	0b0000000000000010,	NULL,NULL}//	EspFsTemplate_cgi,	SoCHWCfg_tpl	}
 ,{( 4<<16) +	0b0000000000000100,	NULL,NULL}//	SoCHWCfg_cgi,		NULL		}
 ,{( 4<<16) +	0b0000000000001000,	NULL,NULL}//	SoCHWCfg_jso,		NULL		}

  // ### WiFi Station Cfg ###
 ,{( 5<<16) +	0b0000000000000010,	NULL,NULL}//	EspFsTemplate_cgi,	StationCfg_tpl	}
 ,{( 5<<16) +	0b0000000000000100,	NULL,NULL}//	StationCfg_cgi,		NULL		}
 ,{( 5<<16) +	0b0000000000001000,	NULL,NULL}//	StationCfg_jso,		NULL		}

  // ### WIFI Q-Connect PAGES ###
 ,{( 6<<16) +	0b0000000000000010,	NULL,NULL}//	EspFsTemplate_cgi,	WifiQConnect_tpl}
 ,{( 7<<16) +	0b0000000000001000,	NULL,NULL}//	WiFiScan_jso,		NULL		}
 ,{( 8<<16) +	0b0000000000000100,	NULL,NULL}//	WiFiConnect_cgi,	NULL		}
 ,{( 9<<16) +	0b0000000000000100,	NULL,NULL}//	WifiSetMode_cgi,	NULL		}	

  // ### Service Access Point Cfg ###
 ,{(10<<16) +	0b0000000000000010,	WebIf_EspFSAdvFileTX,	ServAPCfg_tpl	}
 ,{(10<<16) +	0b0000000000000100,	NULL,NULL}//	ServAPCfg_cgi,		NULL		}
 ,{(10<<16) +	0b0000000000001000,	NULL,NULL}//	ServAPCfg_jso,		NULL		}

  // ### TimeStamp Cfg ###
 ,{(11<<16) +	0b0000000000000010,	NULL,NULL}//	EspFsTemplate_cgi,	TiStCfg_tpl	}
 ,{(11<<16) +	0b0000000000000100,	NULL,NULL}//	TiStCfg_cgi,		NULL		}
 ,{(11<<16) +	0b0000000000001000,	NULL,NULL}//	TiStCfg_jso,		NULL		}

  // ### Firmware Update ###
 ,{(12<<16) +	0b0000000000000010,	NULL,NULL}//	EspFsTemplate_cgi,	FirmwareUd_tpl	}
 ,{(12<<16) +	0b0000000000000100,	NULL,NULL}//	FirmwareUd_cgi,		NULL		}
 ,{(12<<16) +	0b0000000000001000,	NULL,NULL}//	FirmwareUd_jso,		NULL		}

  // ### Redirects ###
 ,{(13<<16) +	0b0000000000000001,	cgiRedirect,	"/WiFi/QConnect.htm"		}
 ,{(14<<16) +	0b0000000000000001,	cgiRedirect,	"/CoNTROL_8S-1C-1ADC.htm"	}
 ,{(14<<16) +	0b0000000000000010,	cgiRedirect,	"/CoNTROL_8S-1C-1ADC.htm"	}

  // ### Secret services ###
 ,{(15<<16) +	0b0000000000100000,	ReadFullFlash_cgi,	NULL		}		//.bin
 ,{(16<<16) +	0b0000000000100000,	NULL,NULL}//	WriteFileSystem_cgi,	NULL		}		//.bin
};



/**
 * -------------------------------------------------------------------------------------------------
 *  DName: ESP32_DeVICE_Module
 *  Desc: Data 'Provided By Module' for the ESP32Control module (functions + infos this module provides
 *        to SCDE)
 *  Data: 
 * -------------------------------------------------------------------------------------------------
 */
ProvidedByModule_t
ESP32_DeVICE_ProvidedByModule = { 	// A-Z order
  "ESP32_DeVICE"					// Type-Name of module -> on Linux libfilename.so !
  ,12								// size of Type-Name

  ,NULL								// Add
  ,ESP32_DeVICE_Attribute			// Attribute
  ,ESP32_DeVICE_Define				// Define
  ,NULL								// Delete
  ,NULL								// DirectRead
  ,NULL								// DirectWrite
  ,NULL								// Except
  ,ESP32_DeVICE_Get					// Get
  ,NULL								// IdleCb
  ,ESP32_DeVICE_Initialize			// Initialize
  ,NULL								// Notify
  ,NULL								// Parse
  ,NULL								// Read
  ,NULL								// Ready
  ,ESP32_DeVICE_Rename				// Rename
  ,ESP32_DeVICE_Set					// Set
  ,ESP32_DeVICE_Shutdown			// Shutdown
  ,ESP32_DeVICE_State				// State
  ,NULL								// Sub
  ,ESP32_DeVICE_Undefine			// Undefine
  ,NULL								// Write
  ,NULL								// FnProvided
  ,sizeof(Entry_ESP32_DeVICE_Definition_t)	// Modul specific Size (Common_Definition_t + X)
};



/* -------------------------------------------------------------------------------------------------
 *  FName: Attribute Fn
 *  Desc: Informs an 'definition' of this 'module' for 'attribute' activities (set/delete)
 *  Info: 'attr_cmmand' is the command for the activity: set, delete
 *        'attr_name' is the attribute name
 *        'attr_value' is the attribute value
 *  Para: Common_Definition_t* p_entry_definition -> the 'definition' identified for the activities
 *	  const String_t attr_command -> the attribute-command
 *	  const String_t attr_name -> the attribute-name
 *	  const String_t attr_value -> the attribute-value
 *  Rets: Entry_String_t* -> = SCDE_OK (no ret msg) or VETO (SLTQ Entry_String_t* with ret msg)
 * -------------------------------------------------------------------------------------------------
 */
Entry_String_t* ICACHE_FLASH_ATTR
ESP32_DeVICE_Attribute(Common_Definition_t* p_entry_definition,
	 const String_t attr_command,
	 const String_t attr_name,
	 const String_t attr_value)
{
  // make common ptr to modul specific ptr
  Entry_ESP32_DeVICE_Definition_t* p_entry_esp32_device_definition =
		  (Entry_ESP32_DeVICE_Definition_t*) p_entry_definition;

  // to store the ret_msg. SCDE_OK = no msg 
  Entry_String_t* p_entry_ret_msg = SCDE_OK;

// -------------------------------------------------------------------------------------------------

  #if ESP32_DeVICE_Module_DBG >= 5
  SCDEFn_at_ESP32_DeVICE_M->Log3Fn(p_entry_esp32_device_definition->common.name,
	p_entry_esp32_device_definition->common.nameLen,
	5,
	"Attribute Fn (Module '%.*s') is called with args: "
	"attr_command '%.*s' attr_name '%.*s' attr_value '%.*s'",
	p_entry_esp32_device_definition->common.module->provided->typeNameLen,
	p_entry_esp32_device_definition->common.module->provided->typeName,attr_command.len,
	attr_command.p_char,
  	attr_name.len,
	attr_name.p_char,
	attr_value.len,
	attr_value.p_char);
  #endif

// ------------------------------------------------------------------------------------------------

  return p_entry_ret_msg;
}



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_Define
 *  Desc: Finalizes the definition of a new "device" of 'ESP32Control' type.
 *        Contains devicespecific init code.
 *  Info: 
 *  Para: Common_Definition_t *Common_Definition -> prefilled ESP32Control Definition
 *        char *Definition -> the last part of the CommandDefine arg* 
 *  Rets: strTextMultiple_t* -> response text NULL=no text
 * -------------------------------------------------------------------------------------------------
 */
strTextMultiple_t*
ESP32_DeVICE_Define(Common_Definition_t *Common_Definition)
{

  // for Fn response msg
  strTextMultiple_t *retMsg = NULL;

  // make common ptr to modul specific ptr
  Entry_ESP32_DeVICE_Definition_t* ESP32_DeVICE_Definition =
		  (Entry_ESP32_DeVICE_Definition_t*) Common_Definition;

// -------------------------------------------------------------------------------------------------

  #if ESP32_DeVICE_Module_DBG >= 5
  SCDEFn_at_ESP32_DeVICE_M->Log3Fn(Common_Definition->name
	,Common_Definition->nameLen
	,5
	,"Executing DefineFn of Module '%.*s' to continue creation of Definition '%.*s' "
	 "with args '%.*s'."
	,ESP32_DeVICE_Definition->common.module->provided->typeNameLen
	,ESP32_DeVICE_Definition->common.module->provided->typeName
	,ESP32_DeVICE_Definition->common.nameLen
	,ESP32_DeVICE_Definition->common.name
	,ESP32_DeVICE_Definition->common.definitionLen
	,ESP32_DeVICE_Definition->common.definition);
  #endif

// ------------------------------------------------------------------------------------------------

  // new conversation
  uint8_t *defArgsText = Common_Definition->definition;
  size_t defArgsTextLen = Common_Definition->definitionLen;

  // Check for args. This type requires args...
  if (!defArgsTextLen) {

	// alloc mem for retMsg
	retMsg = malloc(sizeof(strTextMultiple_t));

