EcSUHA/ESP32_DeVICE_Module/ESP32_DeVICE_Module.c
  return retMsg;
}



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_Initialize
 *  Desc: Initializion of SCDE Function Callbacks of an new loaded module
 *  Info: Stores Module-Information (Function Callbacks) to SCDE-Root
 *  Para: SCDERoot_t* SCDERootptr -> ptr to SCDE Data Root
 *  Rets: ? unused
 *--------------------------------------------------------------------------------------------------
 */
int 
ESP32_DeVICE_Initialize(SCDERoot_t* SCDERootptr)
{

  // make data root locally available
  SCDERoot_at_ESP32_DeVICE_M = SCDERootptr;

  // make locally available from data-root: SCDEFn (Functions / callbacks) for faster operation
  SCDEFn_at_ESP32_DeVICE_M = SCDERootptr->SCDEFn;

// -------------------------------------------------------------------------------------------------

  #if ESP32_DeVICE_Module_DBG >= 3
  SCDEFn_at_ESP32_DeVICE_M->Log3Fn(ESP32_DeVICE_ProvidedByModule.typeName
	,ESP32_DeVICE_ProvidedByModule.typeNameLen
	,3
	,"Executing InitializeFn of Module '%.*s' to make it useable."
	,ESP32_DeVICE_ProvidedByModule.typeNameLen
	,ESP32_DeVICE_ProvidedByModule.typeName);
  #endif

// -------------------------------------------------------------------------------------------------

  return 0;
}












/*
 * ----------------------------- Arg-Parse Stage 2 processing code --------------------------------
 */



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_APST2_WSAP_cb
 *  Desc: ArgParse Stage 2 parsing callback - for key 'WSAP'

 *  Info: - given stage 1 value should be an string 'OPT_STRING'
 *        - the destination-value should be of type 'uint8_t' 
 *  Para: struct argparse *self -> 
 *        const struct argparse_option *option -> 
 *        int flags ->  
 *        char ***stage1Value -> the input value (as a string)
 *  Rets: int result -> 0=OK, -3=ERROR(leadin error msg only, if any), do not use -2,-1  
 * -------------------------------------------------------------------------------------------------
 */
int
ESP32_DeVICE_APST2_WSAP_cb(struct argparse *self
                    ,const struct argparse_option *option
                    ,int flags
                    ,char ***stage1Value)
{
  // get ptr to wifi_ap_config_t
  wifi_mode_t *wifi_mode =
        (wifi_mode_t *)option->value;

  uint8_t new_wifi_mode;

  // check if the argument is in the allowed list

  if (SCDEH_GetQueryKeyID((uint8_t*) **stage1Value
        ,strlen(**stage1Value)
        ,(uint8_t*) &new_wifi_mode
        ,&ESP32_DeVICE_DisEn) ) {

    // store the parsed argument
    wifi_mode = ( ((uint8_t) wifi_mode & 0b01) | (new_wifi_mode << 1) ) ;

    // mark argument as sucessfully parsed
    self->parsedargsbf |= (1 << ESP32_DeVICE_Set_IK_WSAP);	

    return 0;	// OK

  } else {

	// argument is not in the allowed list

    SCDEFn_at_ESP32_DeVICE_M->ArgParse_PrepareLeadinErrorMsgFn(self
          ,option, "value not accepted", flags);

    return -3;  // error msg -> leadin + usage
  }
}



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_APST2_Name_cb
 *  Desc: ArgParse Stage 2 parsing callback - for key 'Name'
 *  Info: - given stage 1 value should be an string 'OPT_STRING'
 *        - the destination-value should be of type 'uint8_t' 
 *  Para: struct argparse *self -> 
 *        const struct argparse_option *option -> 
 *        int flags ->  
 *        char ***stage1Value -> the input value (as a string)
 *  Rets: int result -> 0=OK, -3=ERROR(leadin error msg only, if any), do not use -2,-1  
 * -------------------------------------------------------------------------------------------------
 */
int
ESP32_DeVICE_APST2_Name_cb(struct argparse *self
                    ,const struct argparse_option *option
                    ,int flags
                    ,char ***stage1Value)
{
  // get ptr to wifi_ap_config_t
  wifi_ap_config_t *wifi_ap_config =
        (wifi_ap_config_t *)option->value;

  uint8_t ssid_len = strlen(**stage1Value);

  // check the argument for an valid input
  if (!ssid_len) {

    SCDEFn_at_ESP32_DeVICE_M->ArgParse_PrepareLeadinErrorMsgFn(self
          ,option, "assigned value contains no characters", flags);

    return -3;  // error msg -> leadin + usage
  }

  // check the argument length
  if (ssid_len > 32 ) {

    SCDEFn_at_ESP32_DeVICE_M->ArgParse_PrepareLeadinErrorMsgFn(self
          ,option, "allows max 32 characters", flags);

    return -3;  // error msg -> leadin + usage
  }

  // store the parsed argument
  wifi_ap_config->ssid_len = ssid_len;
  strncpy(&wifi_ap_config->ssid , **stage1Value, ssid_len);

  // mark argument as sucessfully parsed
  self->parsedargsbf |= (1 << ESP32_DeVICE_Set_IK_Name);	

  return 0;	// OK
}



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_APST2_WSAP_Password_cb
 *  Desc: ArgParse Stage 2 parsing callback - for key 'WSAP_Password'
 *  Info: - given stage 1 value should be an string 'OPT_STRING'
 *        - the destination-value should be of type 'uint8_t' 
 *  Para: struct argparse *self -> 
 *        const struct argparse_option *option -> 
 *        int flags ->  
 *        char ***stage1Value -> the input value (as a string)
 *  Rets: int result -> 0=OK, -3=ERROR(leadin error msg only, if any), do not use -2,-1  
 * -------------------------------------------------------------------------------------------------
 */
int
ESP32_DeVICE_APST2_WSAP_Password_cb(struct argparse *self
                    ,const struct argparse_option *option
                    ,int flags
                    ,char ***stage1Value)
{
  // get ptr to wifi_ap_config_t
  wifi_ap_config_t *wifi_ap_config =
        (wifi_ap_config_t *)option->value;

  uint8_t password_len = strlen(**stage1Value);

  // check the argument length
  if (password_len > 63 ) {

    SCDEFn_at_ESP32_DeVICE_M->ArgParse_PrepareLeadinErrorMsgFn(self
          ,option, "allows max 63 characters", flags);

    return -3;  // error msg -> leadin + usage
  }
  
  // store the parsed argument
  strcpy(&wifi_ap_config->password , **stage1Value);

