EcSUHA/ESP32_DeVICE_Module/ESP32_DeVICE_Module.c
  // mark argument as sucessfully parsed
  self->parsedargsbf |= (1 << ESP32_DeVICE_Set_IK_WSAP_Password);	

  return 0;	// OK
}



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_APST2_WSAP_RF_Channel_cb
 *  Desc: ArgParse Stage 2 parsing callback - for key 'WSAP_RF_Channel'
 *  Info: - given stage 1 value should be an string 'OPT_STRING'
 *        - the destination-value should be of type 'uint8_t' 
 *  Para: struct argparse *self -> 
 *        const struct argparse_option *option -> 
 *        int flags ->  
 *        char ***stage1Value -> the input value (as a string)
 *  Rets: int result -> 0=OK, -3=ERROR(leadin error msg only, if any), do not use -2,-1  
 * -------------------------------------------------------------------------------------------------
 */
int
ESP32_DeVICE_APST2_WSAP_RF_Channel_cb(struct argparse *self
                    ,const struct argparse_option *option
                    ,int flags
                    ,char ***stage1Value)
{
  // get ptr to wifi_ap_config_t
  wifi_ap_config_t *wifi_ap_config =
        (wifi_ap_config_t *)option->value;

  uint8_t new_channel;

  // check if the argument is in the allowed list
  if (SCDEH_GetQueryKeyID((uint8_t*) **stage1Value
        ,strlen(**stage1Value)
        ,(uint8_t*) &new_channel
        ,&ESP32_DeVICE_CHANNEL) ) {

    // store the parsed argument
    wifi_ap_config->channel = new_channel;

	// mark argument as sucessfully parsed
  	self->parsedargsbf |= (1 << ESP32_DeVICE_Set_IK_WSAP_RF_Channel);	

    return 0;	// OK

  } else {

	// argument is not in the allowed list
    SCDEFn_at_ESP32_DeVICE_M->ArgParse_PrepareLeadinErrorMsgFn(self
          ,option, "channel not accepted", flags);

    return -3;  // error msg -> leadin + usage
  }
}



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_APST2_WSAP_Authentication_Method_cb
 *  Desc: ArgParse Stage 2 parsing callback - for key 'WSAP_Authentication_Method'
 *  Info: - given stage 1 value should be an string 'OPT_STRING'
 *        - the destination-value should be of type 'uint8_t' 
 *  Para: struct argparse *self -> 
 *        const struct argparse_option *option -> 
 *        int flags ->  
 *        char ***stage1Value -> the input value (as a string)
 *  Rets: int result -> 0=OK, -3=ERROR(leadin error msg only, if any), do not use -2,-1  
 * -------------------------------------------------------------------------------------------------
 */
int
ESP32_DeVICE_APST2_WSAP_Authentication_Method_cb(struct argparse *self
                    ,const struct argparse_option *option
                    ,int flags
                    ,char ***stage1Value)
{
  // get ptr to wifi_ap_config_t
  wifi_ap_config_t *wifi_ap_config =
        (wifi_ap_config_t *)option->value;

  uint8_t new_authmode;

  // check if the argument is in the allowed list
  if (SCDEH_GetQueryKeyID((uint8_t*) **stage1Value
        ,strlen(**stage1Value)
        ,(uint8_t*) &new_authmode
        ,&ESP32_DeVICE_AUTH_MODE) ) {

    // store the parsed argument
    wifi_ap_config->authmode = new_authmode;

	// mark argument as sucessfully parsed
  	self->parsedargsbf |= (1 << ESP32_DeVICE_Set_IK_WSAP_Authentication_Method);	

    return 0;	// OK

  } else {

	// argument is not in the allowed list
    SCDEFn_at_ESP32_DeVICE_M->ArgParse_PrepareLeadinErrorMsgFn(self
          ,option, "method not accepted", flags);

    return -3;  // error msg -> leadin + usage
  }
}



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_APST2_WSAP_SSID_Visibility_cb
 *  Desc: ArgParse Stage 2 parsing callback - for key 'WSAP_SSID_Visibility'
 *  Info: - given stage 1 value should be an string 'OPT_STRING'
 *        - the destination-value should be of type 'uint8_t' 
 *  Para: struct argparse *self -> 
 *        const struct argparse_option *option -> 
 *        int flags ->  
 *        char ***stage1Value -> the input value (as a string)
 *  Rets: int result -> 0=OK, -3=ERROR(leadin error msg only, if any), do not use -2,-1  
 * -------------------------------------------------------------------------------------------------
 */
int
ESP32_DeVICE_APST2_WSAP_SSID_Visibility_cb(struct argparse *self
                    ,const struct argparse_option *option
                    ,int flags
                    ,char ***stage1Value)
{
  // get ptr to wifi_ap_config_t
  wifi_ap_config_t *wifi_ap_config =
        (wifi_ap_config_t *)option->value;

  uint8_t new_ssid_hidden;
  
  // check if the argument is in the allowed list
  if (SCDEH_GetQueryKeyID((uint8_t*) **stage1Value
        ,strlen(**stage1Value)
        ,(uint8_t*) &new_ssid_hidden
        ,&ESP32_DeVICE_SSID_VISIBILITY) ) {

	// store the parsed argument
    wifi_ap_config->ssid_hidden = new_ssid_hidden;

	// mark argument as sucessfully parsed
  	self->parsedargsbf |= (1 << ESP32_DeVICE_Set_IK_WSAP_SSID_Visibility);	

    return 0;	// OK

  } else {

	// argument is not in the allowed list
    SCDEFn_at_ESP32_DeVICE_M->ArgParse_PrepareLeadinErrorMsgFn(self
          ,option, "value not accepted", flags);

    return -3;  // error msg -> leadin + usage
  }
}



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_APST2_WSAP_Maximal_Connections_cb
 *  Desc: ArgParse Stage 2 parsing callback - for key 'WSAP_Maximal_Connections'
 *  Info: - given stage 1 value should be an string 'OPT_INTEGER'
 *        - the destination-value should be of type 'uint8_t' 
 *  Para: struct argparse *self -> 
 *        const struct argparse_option *option -> 
 *        int flags ->  
 *        char ***stage1Value -> the input value (as a string)
 *  Rets: int result -> 0=OK, -3=ERROR(leadin error msg only, if any), do not use -2,-1  
 * -------------------------------------------------------------------------------------------------
 */
int
ESP32_DeVICE_APST2_WSAP_Maximal_Connections_cb(struct argparse *self
                    ,const struct argparse_option *option
                    ,int flags
                    ,int **stage1Value)
{
  // get ptr to wifi_ap_config_t
  wifi_ap_config_t *wifi_ap_config =
        (wifi_ap_config_t *)option->value;

  int new_max_connection = **stage1Value;

  // argument to low ?
  if (new_max_connection < 1) {

    SCDEFn_at_ESP32_DeVICE_M->ArgParse_PrepareLeadinErrorMsgFn(self
          ,option, "must be =>1", flags);

    return -3;  // error msg -> leadin + usage
  }

  // argument to high ?
  if (new_max_connection > 10) {

    SCDEFn_at_ESP32_DeVICE_M->ArgParse_PrepareLeadinErrorMsgFn(self
          ,option, "max 10 allowed", flags);

    return -3;  // error msg -> leadin + usage
  }

  // store the parsed argument
  wifi_ap_config->max_connection = (uint8_t) new_max_connection;

