EcSUHA/ESP32_DeVICE_Module/ESP32_DeVICE_Module.c
  // mark argument as sucessfully parsed
  self->parsedargsbf |= (1 << ESP32_DeVICE_Set_IK_WSAP_Maximal_Connections);	

  return 0;	// OK
}



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_APST2_WSAP_Beacon_Interval_cb
 *  Desc: ArgParse Stage 2 parsing callback - for key 'WSAP_Beacon_Interval'
 *  Info: - given stage 1 value should be an string 'OPT_INTEGER'
 *        - the destination-value should be of type 'uint8_t' 
 *  Para: struct argparse *self -> 
 *        const struct argparse_option *option -> 
 *        int flags ->  
 *        char ***stage1Value -> the input value (as a string)
 *  Rets: int result -> 0=OK, -3=ERROR(leadin error msg only, if any), do not use -2,-1  
 * -------------------------------------------------------------------------------------------------
 */
int
ESP32_DeVICE_APST2_WSAP_Beacon_Interval_cb(struct argparse *self
                    ,const struct argparse_option *option
                    ,int flags
                    ,int **stage1Value)
{
  // get ptr to wifi_ap_config_t
  wifi_ap_config_t *wifi_ap_config =
        (wifi_ap_config_t *)option->value;

  int new_beacon_interval = **stage1Value;

  // argument to low ?
  if (new_beacon_interval < 100) {

    SCDEFn_at_ESP32_DeVICE_M->ArgParse_PrepareLeadinErrorMsgFn(self
          ,option, "maximum is 100 ms", flags);

    return -3;  // error msg -> leadin + usage
  }

  // argument to high ?
  if (new_beacon_interval > 60000) {

    SCDEFn_at_ESP32_DeVICE_M->ArgParse_PrepareLeadinErrorMsgFn(self
          ,option, "minimum is 60000 ms", flags);

    return -3;  // error msg -> leadin + usage
  }

  // store the parsed argument
  wifi_ap_config->beacon_interval = (uint16_t) new_beacon_interval;

  // mark argument as sucessfully parsed
  self->parsedargsbf |= (1 << ESP32_DeVICE_Set_IK_WSAP_Beacon_Interval);	

  return 0;	// OK
}



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_APST2_Station_cb
 *  Desc: ArgParse Stage 2 parsing callback - for key 'Staton'
 *  Info: - given stage 1 value should be an string 'OPT_STRING'
 *        - the destination-value should be of type 'uint8_t' 
 *  Para: struct argparse *self -> 
 *        const struct argparse_option *option -> 
 *        int flags ->  
 *        char ***stage1Value -> the input value (as a string)
 *  Rets: int result -> 0=OK, -3=ERROR(leadin error msg only, if any), do not use -2,-1  
 * -------------------------------------------------------------------------------------------------
 */
int
ESP32_DeVICE_APST2_Station_cb(struct argparse *self
                    ,const struct argparse_option *option
                    ,int flags
                    ,char ***stage1Value)
{
  // get ptr to wifi_ap_config_t
  wifi_mode_t *wifi_mode =
        (wifi_mode_t *) option->value;

  uint8_t new_wifi_mode;

  // check if the argument is in the allowed list
  if (SCDEH_GetQueryKeyID((uint8_t*) **stage1Value
        ,strlen(**stage1Value)
        ,(uint8_t*) &new_wifi_mode
        ,&ESP32_DeVICE_DisEn) ) {

	// store the parsed argument
    wifi_mode = ( ((uint8_t) wifi_mode & 0b10) | new_wifi_mode ) ;

    // mark argument as sucessfully parsed
    self->parsedargsbf |= (1 << ESP32_DeVICE_Set_IK_Station);	

    return 0;	// OK

  } else {

    SCDEFn_at_ESP32_DeVICE_M->ArgParse_PrepareLeadinErrorMsgFn(self
          ,option, "value not accepted", flags);

	// argument is not in the allowed list
    return -3;  // error msg -> leadin + usage
  }
}



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_SwITCH_Set_H_cb
 *  Desc: Processes the device-specific command line arguments from the get command
 *  Info: Invoked by cmd-line 'Get ESP32Control_Definition.common.Name getArgs'
 *  Para: ESP32Control_Definition_t *ESP32Control_Definition -> WebIF Definition that should get a set cmd
 *        uint8_t *getArgsText -> the getArgsText
 *        size_t getArgsTextLen -> length of the getArgsText
 *  Rets: strTextMultiple_t* -> response text in allocated memory, NULL=no text
 * -------------------------------------------------------------------------------------------------
 */
int
ESP32_SwITCH_Set_H_cb(struct argparse *self
                ,const struct argparse_option *option
                ,int flags
                ,void *stage1Value)
{
  // allocate mem to prepare ret msg
  self->retMsg = malloc(sizeof(Entry_String_t));

  // generate concrete error msg - long_name
  self->retMsg->string.len = asprintf(&self->retMsg->string.p_char,
	"?, from available: "
	// Built-in Wireless-Service-Access-Point configuration
	"WSAP:uzsuSelectRadio,DISABLED,ENABLED "
	"Name!!max32 "
	"WSAP_Password !!max63 "
	"WSAP_RF_Channel:uzsuSelectRadio,CH_1,CH_2,CH_3,CH_4,CH_5,CH_6,CH_7,CH_8,CH_9,CH_10,CH_11,CH_12,CH_13,CH_14 "
	"WSAP_Authentication_Method:uzsuSelectRadio,OPEN,WEP,WPA_PSK,WPA2_PSK,WPA_WPA2_PSK,WPA2_ENTERPRISE,WPA3_PSK "
	"WSAP_SSID_Visibility:uzsuSelectRadio,VISIBLE,HIDDEN "
	"WSAP_Maximal_Connections:slider,1,1,10 "
	"WSAP_Beacon_Interval:slider,100,10,60000");

  return -3; // because ArgParse_Usage prepares an retMsg
}

  

/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_APST2_WIFI_COUNTRY_cb
 *  Desc: ArgParse Stage 2 parsing callback for key 'WIFI_COUNTRY'
 *  Info: - given stage 1 value should be an string 'OPT_STRING'
 *        - the destination-value should be of type 'uint8_t' 
 *  Para: struct argparse *self -> 
 *        const struct argparse_option *option -> 
 *        int flags ->  
 *        char ***stage1Value -> the input value (as a string)
 *  Rets: int result -> 0=OK, -3=ERROR(leadin error msg only, if any), do not use -2,-1  
 * -------------------------------------------------------------------------------------------------
 */
int
ESP32_DeVICE_APST2_WIFI_COUNTRY_cb(struct argparse *self
                    ,const struct argparse_option *option
                    ,int flags
                    ,char ***stage1Value)
{

//  wifi_country_t new_WIFI_COUNTRY;
  uint8_t new_WIFI_COUNTRY;

  if (SCDEH_GetQueryKeyID((uint8_t*) **stage1Value
        ,strlen(**stage1Value)
        ,(uint8_t*) &new_WIFI_COUNTRY
        ,&ESP32_DeVICE_WIFI_COUNTRY) ) {

    *(uint8_t *)option->value = new_WIFI_COUNTRY;

