EcSUHA/ESP32_DeVICE_Module/ESP32_DeVICE_Module.c
    return 0;	// OK

  } else {

    SCDEFn_at_ESP32_DeVICE_M->ArgParse_PrepareLeadinErrorMsgFn(self
          ,option, "value not accepted", flags);

    return -3;  // error msg -> leadin + usage
  }
}

















/* --- was soll das Gerät in FHEM können ---
?, from available:

Caps:noArg 

Block #1
Name  !! max32
WSAP_Password !!max63
WSAP_RF_Channel:uzsuSelectRadio,CH_1,CH_2,CH_3,CH_4,CH_5,CH_6,CH_7,CH_8,CH_9,CH_10,CH_11,CH_12,CH_13,CH_14 
WSAP_Authentication_Method:uzsuSelectRadio,OPEN,WEP,WPA_PSK,WPA2_PSK,WPA_WPA2_PSK
WSAP_SSID_Visibility:uzsuSelectRadio,VISIBLE,HIDDEN 
WSAP_Maximal_Connections:slider,1,1,10
WSAP_Beacon_Interval:slider,100,10,60000

WSAP_IP_Adress 
WSAP_Netmask 
WSAP_Gateway_Adress 

WSAP_DHCPS:uzsuSelectRadio,ENABLED,DISABLED 
WSAP_DHCPS_Lease_Start_IP 
WSAP_DHCPS_Lease_End_IP 

WSAP_MAC_Adress 
WSAP_State:uzsuSelectRadio,ENABLED,DISABLED 
Station_IP_Adress 
Station_Netmask 
Station_Gateway_Adress 
Station_State:uzsuSelectRadio,ENABLED,DISABLED 
Station_DHCP:uzsuSelectRadio,ENABLED,DISABLED 
Station_Auto_Connect:uzsuSelectRadio,ENABLED,DISABLED 
Station_Physical_Mode:uzsuSelectRadio,802.11b,802.11g,802.11n 
Station_Get_RSSI:noArg 
Station_MAC_Adress 
TiSt_NTP_Server_Main 
TiSt_NTP_Server_Backup_1 
TiSt_NTP_Server_Backup_2 
TiSt_Time_Zone 
TiSt_Get_Time 
SoCHW_Restart:noArg 
SoCHW_Factory_Reset_SCDE:noArg 
SoCHW_Factory_Reset_CAPI:noArg 
SoCHW_Factory_Reset:noArg 
*/



/** Get - New Version (2)
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_Get V2
 *  Desc: Implements the device-specific get function. Is used to get information from device.
 *  Info: Typically invoked by cmd-line 'get ESP32Control_Definition.common.Name getArgs'
 *             aa bbb ccc "dd d" ee         <- original string
 *             ---------------------
 *             aa0bbb0ccc00dd d00ee0        <- transformed string
 *             |  |   |    |     |
 *   argv[0] __/  /   /    /     /
 *   argv[1] ____/   /    /     /
 *   argv[2] _______/    /     /
 *   argv[3] ___________/     /
 *   argv[4] ________________/ 
 *   Note: 1 args inside '""' are not splitted !
 *  Para: Entry_Definition_t* p_definition -> the ESP32_DeVICE_Definition that should be processed
 *        char **argv                      -> the arguments *argv[x]
 *        int argc                         -> the number of arguments (x)
 *  Rets: Entry_String_t* p_retMsg         -> response message as string, NULL=OK, without text
 * -------------------------------------------------------------------------------------------------
 */
Entry_String_t*
ESP32_DeVICE_GetV2(Entry_Definition_t* p_Definition
                ,char **argv
                ,int argc)
{
  // for Fn response msg
  Entry_String_t *p_retMsg = NULL;

  // make common ptr to modul specific ptr
  Entry_ESP32_DeVICE_Definition_t* p_ESP32_DeVICE_Definition =
	(Entry_ESP32_DeVICE_Definition_t*) p_Definition;

// -------------------------------------------------------------------------------------------------

  #if ESP32_DeVICE_Module_DBG >= 5
  SCDEFn_at_ESP32_DeVICE_M->Log3Fn(p_Definition->name
	,p_Definition->nameLen
	,5
	,"GetV2Fn of Module '%.*s' is called for Definition '%.*s'. Definition shall respond to GET arguments '%s'."
	,p_Definition->module->provided->typeNameLen
	,p_Definition->module->provided->typeName
	,p_Definition->nameLen
	,p_Definition->name
	,*argv);
  #endif	

// -------------------------------------------------------------------------------------------------
// 1. Step: Create backup structures, if required mirror current values from SDK
// -------------------------------------------------------------------------------------------------

  // block #01 get 'wifi_ap_config' (WSAP-Configuration)
  wifi_ap_config_t wifi_ap_config;
  esp_wifi_get_config (WIFI_IF_AP, &wifi_ap_config);

// -------------------------------------------------------------------------------------------------

  // block #02 get 'tcpip_adapter_ip_info_t' (WSAP-IP-Settings)
  tcpip_adapter_ip_info_t ap_ip_info;
  tcpip_adapter_get_ip_info(TCPIP_ADAPTER_IF_AP, &ap_ip_info);

/*				 ( ESP32_DeVICE_R_WSAP_IP_Adress
				    | ESP32_DeVICE_R_WSAP_Netmask
				    | ESP32_DeVICE_R_WSAP_Gateway_Adress) ) {*/

// -------------------------------------------------------------------------------------------------


/*
  ,ESP32_DeVICE_R_WSAP
  ,ESP32_DeVICE_R_Station*/



  // block #?? get 'wifi_mode_t' (WIFI WSAP+STA Configuration)
  wifi_mode_t wifi_mode;
  esp_wifi_get_mode(&wifi_mode);
 




  // block #3 get current Service AP MAC Adress
  uint8_t ap_mac_addr[8];
  esp_wifi_get_mac(WIFI_IF_AP,(uint8_t *) &ap_mac_addr);

  // block #4 get the bandwith of the Service Access Point
  wifi_bandwidth_t ap_wifi_bandwidth;
  esp_wifi_get_bandwidth(WIFI_IF_AP, &ap_wifi_bandwidth);

  // block #5 get the WiFi Country
//  wifi_country_t country;
//  esp_wifi_get_country(&country);

  // block #6 get current Station IP Settings
  tcpip_adapter_ip_info_t sta_ip_info;
  tcpip_adapter_get_ip_info(TCPIP_ADAPTER_IF_STA, &sta_ip_info);

  // block #7 get current Station MAC Adress
  uint8_t sta_mac_addr[8];
  esp_wifi_get_mac(WIFI_IF_STA, (uint8_t *) &sta_mac_addr);

  // block #8 get current Station Auto-Connect-Status
  bool sta_autoconnect_status;
//  esp_wifi_get_auto_connect(&sta_autoconnect_status);

 // block #9 mirror 'wifi_bandwidth_t' (WIFI STA Configuration)
  wifi_bandwidth_t wifiBandwidthSTA;
  esp_wifi_get_bandwidth(WIFI_IF_STA, &wifiBandwidthSTA);

 		//(1 << ESP32_DeVICE_R_WSAP_WiFi_Bandwidth) ) {




//#3
  // block #6 get current Station Settings
  wifi_config_t sta_wifi_config;
  esp_wifi_get_config(WIFI_IF_STA, &sta_wifi_config);

  // block #3 get current Service AP DHCP-Server-Status
  tcpip_adapter_dhcp_status_t ap_dhcp_status;
  tcpip_adapter_dhcps_get_status(TCPIP_ADAPTER_IF_AP,&ap_dhcp_status); 
//esp_err_t tcpip_adapter_dhcps_stop(tcpip_adapter_if_t tcpip_if);
//esp_err_t tcpip_adapter_dhcps_start(tcpip_adapter_if_t tcpip_if);

