EcSUHA/ESP32_DeVICE_Module/ESP32_DeVICE_Module.c
    OPT_GROUP  ("Debug testing configuration"),
    OPT_BIT      ( 0 , "read",   					&perms,      		"read perm", 					NULL, 												PERM_READ, OPT_NONEG),
    OPT_BIT      ( 0 , "write",  					&perms,      		"write perm", 					NULL, 												PERM_WRITE, 0),
    OPT_BIT      ( 0 , "exec",   					&perms,      		"exec perm", 					NULL, 												PERM_EXEC, 0),

    OPT_GROUP  ("Time configuration"),
    OPT_FLOAT    ('x', "float2", 					&flt_test2,  		"selected float2", 				NULL, 												0, 0),
    OPT_STRING   ('y', "path2",  					&path_test2, 		"path to read2", 				NULL, 												0, 0),
    OPT_END(),
  };

  // init the arg-parse Fn
  p_retMsg = SCDEFn_at_ESP32_DeVICE_M->ArgParse_InitFn(&argparse
	,options
	,usages
	,0	// flags: ARGPARSE_STOP_AT_NON_OPTION ?
	,"\nTo SET the configuration of the ESP32 DeVICE"										// prolog usage
	,"\nUse command help ESP32_DeVICE to get the detailed description of the arguments.");	// epilog usage
  if (p_retMsg) goto error2;	// got an error-msg text -> send it to the user!

  // call the parse Fn
  p_retMsg = SCDEFn_at_ESP32_DeVICE_M->ArgParse_ParseFn(&argparse, argc, argv);
  if (p_retMsg) goto error2;	// got an error-msg text -> send it to the user!

  // wie genau?? mem leak?
  // get the resulting args-no from arg parse fn
  argc = argparse.cpidx + argparse.argc;


  if (argc < 0) printf("An error occured? argc: %d\n", argc);







  // deep debug
  printf("\nDeep debugging, parsed args bf: %lld, listing parsed values:\n",
  	 argparse.parsedargsbf);

  // debugout ssid aka name, if found ...
  if (argparse.parsedargsbf & (1 << ESP32_DeVICE_Set_IK_Name) ) {
  	printf("parsed name=%.*s\n"
		,wifi_ap_config.ssid_len
		,wifi_ap_config.ssid);
  }

  // debugout WSAP_Password, if found ...
  if (argparse.parsedargsbf & (1 << ESP32_DeVICE_Set_IK_WSAP_Password) ) {
  	printf("parsed WSAP_Password=%s\n"
		,wifi_ap_config.password);
  }

  // debugout WSAP_RF_Channel, if found ...
  if (argparse.parsedargsbf & (1 << ESP32_DeVICE_Set_IK_WSAP_RF_Channel) ) {
  	printf("parsed WSAP_RF_Channel=%d\n"
		,wifi_ap_config.channel);
  }

  // debugout WSAP_Authentication_Method, if found ...
  if (argparse.parsedargsbf & (1 << ESP32_DeVICE_Set_IK_WSAP_Authentication_Method) ) {
  	printf("WSAP_Authentication_Method=%d\n"
		,wifi_ap_config.authmode);
  }

  // debugout WSAP_SSID_Visibility, if found ...
  if (argparse.parsedargsbf & (1 << ESP32_DeVICE_Set_IK_WSAP_SSID_Visibility) ) {
  	printf("WSAP_SSID_Visibility=%d\n"
		,wifi_ap_config.ssid_hidden);
  }

  // debugout WSAP_Maximal_Connections, if found ...
  if (argparse.parsedargsbf & (1 << ESP32_DeVICE_Set_IK_WSAP_Maximal_Connections) ) {
  	printf("WSAP_Maximal_Connections=%d\n"
		,wifi_ap_config.max_connection);
  }

  // debugout WSAP_Beacon_Interval, if found ...
  if (argparse.parsedargsbf & (1 << ESP32_DeVICE_Set_IK_WSAP_Beacon_Interval) ) {
  	printf("WSAP_Beacon_Interval=%d\n"
		,wifi_ap_config.beacon_interval);
  }

 // debugout WSAP, if found ...
  if (argparse.parsedargsbf & (1 << ESP32_DeVICE_Set_IK_WSAP) ) {
  	printf("WSAP=%d\n"
		,( (uint8_t) wifi_mode & 0b10) >>1 );
  }
  
 // debugout Station, if found ...
  if (argparse.parsedargsbf & (1 << ESP32_DeVICE_Set_IK_Station) ) {
  	printf("Station=%d\n"

		,((uint8_t) wifi_mode & 0b01) );
  }






/*
Was wir brauchen:

  // set enabled keys -> keys that are currently enabled (for devices that change behviour)
  parsedKVInput->enabledKVBF = 0;

  // set required Keys -> Keys that should be there in this request
  parsedKVInput->requiredKVBF = ( (1 << ESP32_SwITCH_SET_GPIO)
			        | (1 << ESP32_SwITCH_SET_BLOCK)
			        | (1 << ESP32_SwITCH_SET_CHANNEL)
			        | (1 << ESP32_SwITCH_SET_TIMER)
			        | (1 << ESP32_SwITCH_SET_DUTY)
			        | (1 << ESP32_SwITCH_SET_HPOINT)
			        | (1 << ESP32_SwITCH_SET_SIG_OUT_EN)
			        | (1 << ESP32_SwITCH_SET_IDLE_LV)
			        | (1 << ESP32_SwITCH_SET_RESOLUTION)
			        | (1 << ESP32_SwITCH_SET_TICK_SOURCE)
			        | (1 << ESP32_SwITCH_SET_FREQ_HZ) );

  // set forbidden Keys -> Keys that are not allowed in this request
  parsedKVInput->forbiddenKVBF = 0;

+ timestamp für readings (reading blocks)
*/










  // opt-group 1
  if (force != 0)
        printf("force: %d\n", force);
  if (test != 0)
        printf("test: %d\n", test);
  if (path != NULL)
        printf("path: %s\n", path);
  if (int_num != 0)
        printf("int_num: %d\n", int_num);
  if (flt_num != 0)
        printf("flt_num: %g\n", flt_num);

  // opt-group 2
  if (perms) {
        printf("perms: %d\n", perms);
  }
 
  // opt-group 3
  if (flt_test2 != 0)
        printf("flt_test2: %g\n", flt_test2);

  if (path_test2 != NULL)
        printf("path_test2: %s\n", path_test2);

  // the rest ..
  if (argc > 0) { //!=
        printf("other args: %d\n", argc);
        int i;
        for (i = 0; i < argc; i++) {
            printf("argv[%d]: %s\n", i, *(argv + i));
        } 
  }

// wie kann festgestellt werden ob eine Eingabe erfolgte z.B. float 0 ?

  printf("WIFI_COUNTRY=%s"
         ,SCDE_GetDesc(ESP32_DeVICE_WIFI_COUNTRY, country));

// ------------------------------------------------------------------------------------------------












  // remember the readings affected by the parsing process
  // on value change can affect multipe readings -> bitfield
  uint32_t affectedReadings = 0;

 // debugview all readings
  affectedReadings = 0xffffffff;

 printf ("AffectedReadings:%d", affectedReadings);
 
 
// -------------------------------------------------------------------------------------------------
// 5. Step: update the Readings according to 'affectedReadings' - if any ...
// -------------------------------------------------------------------------------------------------

  // update the Readings according to 'affectedReadings' - if any ...
  if (affectedReadings) {

	SCDEFn_at_ESP32_DeVICE_M->readingsBeginUpdateFn((Common_Definition_t*) p_ESP32_DeVICE_Definition);

// ------------------------------------------------------------------------------------------------- 

	// Reading 'Name'
	if (affectedReadings & ESP32_DeVICE_R_Name) {

