EcSUHA/ESP32_DeVICE_Module/ESP32_DeVICE_Module.c
		// create / update reading
		SCDEFn_at_ESP32_DeVICE_M->readingsBulkUpdate2Fn((Common_Definition_t*) p_ESP32_DeVICE_Definition
			,strlen((const char *) ESP32_DeVICE_Set_ImplementedKeys[ESP32_DeVICE_Set_IK_Name].implementedKey)
			,(const uint8_t *) ESP32_DeVICE_Set_ImplementedKeys[ESP32_DeVICE_Set_IK_Name].implementedKey
			,wifi_ap_config.ssid_len
			,wifi_ap_config.ssid
			,true);
	}

// -------------------------------------------------------------------------------------------------

	// Reading 'WSAP_Password'
	if (affectedReadings & ESP32_DeVICE_R_WSAP_Password) {

		// create / update reading
		SCDEFn_at_ESP32_DeVICE_M->readingsBulkUpdate2Fn((Common_Definition_t*) p_ESP32_DeVICE_Definition
			,strlen((const char *) ESP32_DeVICE_Set_ImplementedKeys[ESP32_DeVICE_Set_IK_WSAP_Password].implementedKey)
			,(const uint8_t *) ESP32_DeVICE_Set_ImplementedKeys[ESP32_DeVICE_Set_IK_WSAP_Password].implementedKey
			,strlen((char *) wifi_ap_config.password)
			,wifi_ap_config.password
			,true);
	}

// ------------------------------------------------------------------------------------------------- 

	// Reading 'WSAP_RF_Channel'
	if (affectedReadings & ESP32_DeVICE_R_WSAP_RF_Channel) {

		// create / update reading
		SCDEFn_at_ESP32_DeVICE_M->readingsBulkUpdate2Fn((Common_Definition_t*) p_ESP32_DeVICE_Definition
			,strlen((const char *) ESP32_DeVICE_Set_ImplementedKeys[ESP32_DeVICE_Set_IK_WSAP_RF_Channel].implementedKey)
			,(const uint8_t *) ESP32_DeVICE_Set_ImplementedKeys[ESP32_DeVICE_Set_IK_WSAP_RF_Channel].implementedKey
			,strlen(SCDE_GetDesc(ESP32_DeVICE_CHANNEL, wifi_ap_config.channel))
			,(const uint8_t *) SCDE_GetDesc(ESP32_DeVICE_CHANNEL, wifi_ap_config.channel)
			,true);
	}
	
// ------------------------------------------------------------------------------------------------- 

	// Reading 'WSAP_Maximal_Connections'
	if (affectedReadings & ESP32_DeVICE_R_WSAP_Maximal_Connections) {

		String_t WSAP_Maximal_Connections;

		// create temporary text
		WSAP_Maximal_Connections.len = asprintf(&WSAP_Maximal_Connections.p_char,"%d"
			,wifi_ap_config.max_connection);

		// create / update reading
		SCDEFn_at_ESP32_DeVICE_M->readingsBulkUpdate2Fn((Common_Definition_t*) p_ESP32_DeVICE_Definition
			,strlen((const char *) ESP32_DeVICE_Set_ImplementedKeys[ESP32_DeVICE_Set_IK_WSAP_Maximal_Connections].implementedKey)
			,(const uint8_t *) ESP32_DeVICE_Set_ImplementedKeys[ESP32_DeVICE_Set_IK_WSAP_Maximal_Connections].implementedKey
			,WSAP_Maximal_Connections.len
			,WSAP_Maximal_Connections.p_char
			,true);
			
		free(WSAP_Maximal_Connections.p_char);
	}

// ------------------------------------------------------------------------------------------------- 

	// Reading 'WSAP_Authentication_Method'
	if (affectedReadings & ESP32_DeVICE_R_WSAP_Authentication_Method) {

 		// create / update reading
		SCDEFn_at_ESP32_DeVICE_M->readingsBulkUpdate2Fn((Common_Definition_t*) p_ESP32_DeVICE_Definition
			,strlen((const char *) ESP32_DeVICE_Set_ImplementedKeys[ESP32_DeVICE_Set_IK_WSAP_Authentication_Method].implementedKey)
			,(const uint8_t *) ESP32_DeVICE_Set_ImplementedKeys[ESP32_DeVICE_Set_IK_WSAP_Authentication_Method].implementedKey
			,strlen(SCDE_GetDesc(ESP32_DeVICE_AUTH_MODE, wifi_ap_config.ssid_hidden))
			,(const uint8_t *) SCDE_GetDesc(ESP32_DeVICE_AUTH_MODE, wifi_ap_config.ssid_hidden)
			,true);
	}

// ------------------------------------------------------------------------------------------------- 

	// Reading 'WSAP_SSID_Visibility'
	if (affectedReadings & ESP32_DeVICE_R_WSAP_SSID_Visibility) {

		// create / update reading
		SCDEFn_at_ESP32_DeVICE_M->readingsBulkUpdate2Fn((Common_Definition_t*) p_ESP32_DeVICE_Definition
			,strlen((const char *) ESP32_DeVICE_Set_ImplementedKeys[ESP32_DeVICE_Set_IK_WSAP_SSID_Visibility].implementedKey)
			,(const uint8_t *) ESP32_DeVICE_Set_ImplementedKeys[ESP32_DeVICE_Set_IK_WSAP_SSID_Visibility].implementedKey
			,strlen(SCDE_GetDesc(ESP32_DeVICE_SSID_VISIBILITY, wifi_ap_config.authmode))
			,(const uint8_t *) SCDE_GetDesc(ESP32_DeVICE_SSID_VISIBILITY, wifi_ap_config.authmode)
			,true);
	}

// ------------------------------------------------------------------------------------------------- 

	// Reading 'WSAP_Beacon_Interval'
	if (affectedReadings & ESP32_DeVICE_R_WSAP_Beacon_Interval) {

		String_t WSAP_Beacon_Interval;

		// create temporary text
		WSAP_Beacon_Interval.len = asprintf(&WSAP_Beacon_Interval.p_char,"%d"
			,wifi_ap_config.beacon_interval);

		// create / update reading
		SCDEFn_at_ESP32_DeVICE_M->readingsBulkUpdate2Fn((Common_Definition_t*) p_ESP32_DeVICE_Definition
			,strlen((const char *) ESP32_DeVICE_Set_ImplementedKeys[ESP32_DeVICE_Set_IK_WSAP_Beacon_Interval].implementedKey)
			,(const uint8_t *) ESP32_DeVICE_Set_ImplementedKeys[ESP32_DeVICE_Set_IK_WSAP_Beacon_Interval].implementedKey
			,WSAP_Beacon_Interval.len
			,WSAP_Beacon_Interval.p_char
			,true);
			
		free(WSAP_Beacon_Interval.p_char);
	}
	
// ------------------------------------------------------------------------------------------------- 

	// Reading 'WSAP'
	if (affectedReadings & ESP32_DeVICE_R_WSAP) {

		// create / update reading
		SCDEFn_at_ESP32_DeVICE_M->readingsBulkUpdate2Fn((Common_Definition_t*) p_ESP32_DeVICE_Definition
			,strlen((const char *) ESP32_DeVICE_Set_ImplementedKeys[ESP32_DeVICE_Set_IK_WSAP].implementedKey)
			,(const uint8_t *) ESP32_DeVICE_Set_ImplementedKeys[ESP32_DeVICE_Set_IK_WSAP].implementedKey
			,strlen(SCDE_GetDesc(ESP32_DeVICE_DisEn, (( (uint8_t) wifi_mode & 0b10) >>1 ) ))
			,(const uint8_t *) SCDE_GetDesc(ESP32_DeVICE_DisEn, (((uint8_t) wifi_mode & 0b10)>>1)  )
			,true);
	}

// ------------------------------------------------------------------------------------------------- 

	// Reading 'Station'
	if (affectedReadings & ESP32_DeVICE_R_Station) {

		// create / update reading
		SCDEFn_at_ESP32_DeVICE_M->readingsBulkUpdate2Fn((Common_Definition_t*) p_ESP32_DeVICE_Definition
			,strlen((const char *) ESP32_DeVICE_Set_ImplementedKeys[ESP32_DeVICE_Set_IK_Station].implementedKey)
			,(const uint8_t *) ESP32_DeVICE_Set_ImplementedKeys[ESP32_DeVICE_Set_IK_Station].implementedKey
			,strlen(SCDE_GetDesc(ESP32_DeVICE_DisEn, ((uint8_t) wifi_mode & 0b01) ))
			,(const uint8_t *) SCDE_GetDesc(ESP32_DeVICE_DisEn, ((uint8_t) wifi_mode & 0b01) )
			,true);
	}
	
// -------------------------------------------------------------------------------------------------

  SCDEFn_at_ESP32_DeVICE_M->readingsEndUpdateFn((Common_Definition_t*) p_ESP32_DeVICE_Definition, true);
  }



















// ------------------------------------------------------------------------------------------------

error2:

// ------------------------------------------------------------------------------------------------

//error1:

  return p_retMsg;
}


















/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_Get
 *  Desc: Processes the device-specific command line arguments from the get command
 *  Info: Invoked by cmd-line 'Get ESP32Control_Definition.common.Name getArgs'
 *  Para: ESP32Control_Definition_t *ESP32Control_Definition -> WebIF Definition that should get a set cmd
 *        uint8_t *getArgsText -> the getArgsText
 *        size_t getArgsTextLen -> length of the getArgsText
 *  Rets: strTextMultiple_t* -> response text in allocated memory, NULL=no text
 * -------------------------------------------------------------------------------------------------
 */
strTextMultiple_t*
ESP32_DeVICE_Get(Common_Definition_t* Common_Definition
                ,uint8_t *getArgsText
                ,size_t getArgsTextLen)
{

  // for Fn response msg
  strTextMultiple_t *retMsg = NULL;

  // make common ptr to modul specific ptr
  Entry_ESP32_DeVICE_Definition_t* ESP32_DeVICE_Definition =
	(Entry_ESP32_DeVICE_Definition_t*) Common_Definition;

// -------------------------------------------------------------------------------------------------

  #if ESP32_DeVICE_Module_DBG >= 5
  SCDEFn_at_ESP32_DeVICE_M->Log3Fn(Common_Definition->name
	,Common_Definition->nameLen
	,5
	,"GetFn of Module '%.*s' is called for Definition '%.*s'. Definition shall respond to GET arguments '%.*s'."
	,Common_Definition->module->provided->typeNameLen
	,Common_Definition->module->provided->typeName
	,Common_Definition->nameLen
	,Common_Definition->name
	,getArgsTextLen
	,getArgsText);
  #endif	

// -------------------------------------------------------------------------------------------------

  // note: call to _Get Fn is blocked with getArgsTextLen = 0 !

