EcSUHA/ESP32_DeVICE_Module/ESP32_DeVICE_Module.c
/*
  // note: '?' KEY is not emplemented -> the error-msg is the correct answer !

  // getArgsText '?' -> respond with help
  if ( (getArgsTextLen > 0) && (*getArgsText == 'X') ) {

	// set start of possible Type-Name
	const uint8_t *tempTxt = getArgsText + 1;

	// a seek-counter
	int i = 1;

	// skip spaces after '?' (search for more ...)
	while( (i < getArgsTextLen) && (*tempTxt == ' ') ) {i++;tempTxt++;}


	// only spaces after '?' -> answer with get-Capabilities
	if (i == getArgsTextLen) {

		// response with error text
		// alloc mem for retMsg
		retMsg = malloc(sizeof(strTextMultiple_t));

		// response with error text
		retMsg->strTextLen = asprintf(&retMsg->strText
			,"requested ? '%.*s' ! This will be removed..."
			,getArgsTextLen
			,getArgsText);

		return retMsg;

		}
	// '? + X' here !!! -> normal parse -> will throw error in next step
	}
*/
// ------------------------------------------------------------------------------------------------

  char **argv;
  int argc;

  // split 'getArgsText' the default way
  argv = SCDEFn_at_ESP32_DeVICE_M->ArgParse_SplitArgsToAllocatedMemFn(&argc, getArgsText, getArgsTextLen);

  retMsg = (strTextMultiple_t*) ESP32_DeVICE_GetV2(Common_Definition
                ,argv, argc);


  // ArgParseFn has allocated mem. Free it.
  SCDEFn_at_ESP32_DeVICE_M->ArgParse_FreeSplittedArgsInAllocatedMemFn(argv);

// ------------------------------------------------------------------------------------------------

  return retMsg;
}









int
ESP32_DeVICE_help_cb(struct argparse *self, const struct argparse_option *option)
{
  (void)option;

//  ArgParse_Usage(self);

printf("HELP-callback\n");

 return 0;//-3; // because ArgParse_Usage prepares an retMsg
//    exit(0);
}


















/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_Rename
 *  Desc: FN is called when a Definition of this Module was renamed. Module can do further things here. 
 *  Info: An FN for Rename is optional!
 *  Para: Entry_ESP32_DeVICE_Definition_t *ESP32_DeVICE_Definition -> ESP32_DeVICE Definition that was renamed
 *        uint8_t *newName -> ptr to the new name (do we need it???)
 *        size_t newNameLen -> length of the new name
 *        uint8_t *oldName -> ptr to old name
 *        size_t oldNameLen -> length of the old name
 *  Rets: strTextMultiple_t* -> response text in allocated memory, NULL=no text
 * -------------------------------------------------------------------------------------------------
 */
strTextMultiple_t*
ESP32_DeVICE_Rename(Common_Definition_t *Common_Definition
	,uint8_t *newName
	,size_t newNameLen
	,uint8_t *oldName
	,size_t oldNameLen)
{
	
  // for Fn response msg
  strTextMultiple_t *multipleRetMsg = NULL;
	
  // make common ptr to modul specific ptr
  Entry_ESP32_DeVICE_Definition_t* ESP32_DeVICE_Definition =
		(Entry_ESP32_DeVICE_Definition_t*) Common_Definition;

// -------------------------------------------------------------------------------------------------

  #if ESP32_DeVICE_Module_DBG >= 5
  SCDEFn_at_ESP32_DeVICE_M->Log3Fn(Common_Definition->name
		,Common_Definition->nameLen
		,5
		,"Executing RenameFn of Module '%.*s'. "
		 "An definition is renamed from old name '%.*s' to new name '%.*s'."
		,ESP32_DeVICE_Definition->common.module->provided->typeNameLen
		,ESP32_DeVICE_Definition->common.module->provided->typeName
		,oldName
		,oldNameLen
		,newName
		,newNameLen);
  #endif
	
// -------------------------------------------------------------------------------------------------

  return multipleRetMsg;
}
	

























/*
 * Find the first occurrence of find in s, where the search is limited to the
 * first slen characters of s.
 */
char * ICACHE_FLASH_ATTR
ESP32_DeVICE_strnstr(s, find, slen)
	const char *s;
	const char *find;
	size_t slen;
{
	char c, sc;
	size_t len;

	if ((c = *find++) != '\0') {
		len = strlen(find);
		do {
			do {
				if ((sc = *s++) == '\0' || slen-- < 1)
					return (NULL);
			} while (sc != c);
			if (len > slen)
				return (NULL);
		} while (strncmp(s, find, len) != 0);
		s--;
	}
	return ((char *)s);
}














/*"WSAP_Password ";
	$list .= "WSAP_RF_Channel:uzsuSelectRadio,1,2,3,4,5,6,7,8,9,10,11,12,13 ";

"WSAP_Beacon_Interval:slider,100,10,60000 ";

uint8Slider,a,b,c
uint16Slider,a,b,c
uint32Slider,a,b,c
int8Slider,a,b,c
int16Slider,a,b,c
int32Slider,a,b,c


*/








	







/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_Set
 *  Desc: Processes the device-specific command line arguments from the set command
 *  Info: Invoked by cmd-line 'Set ESP32_DeVICE_Definition.common.Name setArgs'
 *  Para: Entry_ESP32_DeVICE_Definition_t *ESP32_DeVICE_Definition -> WebIF Definition that should get a set cmd
 *        uint8_t *setArgs -> the setArgs
 *        size_t setArgsLen -> length of the setArgs
 *  Rets: strTextMultiple_t* -> response text in allocated memory, NULL=no text
 * -------------------------------------------------------------------------------------------------
 */
strTextMultiple_t* ICACHE_FLASH_ATTR
ESP32_DeVICE_Set(Common_Definition_t* Common_Definition
	,uint8_t *setArgsText
	,size_t setArgsTextLen)
{
  // for Fn response msg
  strTextMultiple_t *retMsg = NULL;

  // make common ptr to modul specific ptr
  Entry_ESP32_DeVICE_Definition_t* ESP32_DeVICE_Definition =
	(Entry_ESP32_DeVICE_Definition_t*) Common_Definition;

// -------------------------------------------------------------------------------------------------

  #if ESP32_DeVICE_Module_DBG >= 5
  SCDEFn_at_ESP32_DeVICE_M->Log3Fn(Common_Definition->name
		,Common_Definition->nameLen
		,5
		,"Executing SetFn of Module '%.*s' for Definition '%.*s' with attached args '%.*s'."
		,ESP32_DeVICE_Definition->common.module->provided->typeNameLen
		,ESP32_DeVICE_Definition->common.module->provided->typeName
		,ESP32_DeVICE_Definition->common.nameLen
		,ESP32_DeVICE_Definition->common.name
		,setArgsTextLen
		,setArgsText);
  #endif

// ------------------------------------------------------------------------------------------------

