EcSUHA/ESP32_DeVICE_Module/ESP32_DeVICE_Module.c
//args ? here

// ------------------------------------------------------------------------------------------------

  // Parse set-args (KEY=VALUE) protocol -> gets parsedKVInput in allocated mem, NULL = ERROR
  parsedKVInputArgs_t *parsedKVInput = 
	SCDEFn_at_ESP32_DeVICE_M->ParseKVInputArgsFn(ESP32_DeVICE_Set_NUMBER_OF_IK	// Num Implementated KEYs MAX
	,ESP32_DeVICE_Set_ImplementedKeys				// Implementated Keys
	,setArgsText
	,setArgsTextLen);

  // parsing may report an problem. args contain: unknown keys, double keys, ...?
  if (!parsedKVInput) {

	// alloc mem for retMsg
	retMsg = malloc(sizeof(strTextMultiple_t));

	// response with error text
	retMsg->strTextLen = asprintf(&retMsg->strText
		,"Parsing Error! Args '%.*s' not taken! Check the KEYs!"
		,setArgsTextLen
		,setArgsText);

	return retMsg;
  }

// ------------------------------------------------------------------------------------------------

  // set required Keys -> Keys that should be there in this request
  parsedKVInput->requiredKVBF = 0;/*( (1 << ESP32_SwITCH_SET_GPIO)
			        | (1 << ESP32_SwITCH_SET_BLOCK)
			        | (1 << ESP32_SwITCH_SET_CHANNEL)
			        | (1 << ESP32_SwITCH_SET_TIMER)
			        | (1 << ESP32_SwITCH_SET_DUTY)
			        | (1 << ESP32_SwITCH_SET_HPOINT)
			        | (1 << ESP32_SwITCH_SET_SIG_OUT_EN)
			        | (1 << ESP32_SwITCH_SET_IDLE_LV)
			        | (1 << ESP32_SwITCH_SET_RESOLUTION)
			        | (1 << ESP32_SwITCH_SET_TICK_SOURCE)
			        | (1 << ESP32_SwITCH_SET_FREQ_HZ) );*/

  // set forbidden Keys -> Keys that are not allowed in this request
  parsedKVInput->forbiddenKVBF = 0;

  // process the set-args (key=value@) protocol
  if (ESP32_DeVICE_ProcessKVInputArgs(ESP32_DeVICE_Definition
	,parsedKVInput
	,setArgsText
	,setArgsTextLen) ) {

 	// Processing reports an problem. Args not taken. Response with error text.

	// alloc mem for retMsg
	retMsg = malloc(sizeof(strTextMultiple_t));

	// response with error text
	retMsg->strTextLen = asprintf(&retMsg->strText
		,"Processing Error! Args '%.*s' not taken! Check the VALUEs!"
		,setArgsTextLen
		,setArgsText);

	// free allocated memory for query result key-field
	free(parsedKVInput);

	return retMsg;
  }

// ------------------------------------------------------------------------------------------------

  // set affected readings
 // ESP32_DeVICE_SetAffectedReadings(ESP32_DeVICE_Definition
//	,parsedKVInput->affectedReadingsBF);

// ------------------------------------------------------------------------------------------------

  // free allocated memory for query result key-field
  free(parsedKVInput);

  return retMsg;
}



/**
 * --------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_Shutdown
 *  Desc: called after 
 *  Info: Invoked by cmd-line 'Undefine ESP32_DeVICE_Definition.common.Name'
 *  Para: Entry_ESP32_DeVICE_Definition_t *ESP32_DeVICE_Definition -> WebIF Definition that should be removed
 *  Rets: strTextMultiple_t* -> response text NULL=no text
 * --------------------------------------------------------------------------------------------------
 */
strTextMultiple_t* ICACHE_FLASH_ATTR
ESP32_DeVICE_Shutdown(Common_Definition_t* Common_Definition)
{

  // for Fn response msg
  strTextMultiple_t *retMsg = NULL;

  // make common ptr to modul specific ptr
  Entry_ESP32_DeVICE_Definition_t* ESP32_DeVICE_Definition =
	(Entry_ESP32_DeVICE_Definition_t*) Common_Definition;

// -------------------------------------------------------------------------------------------------

  #if ESP32_DeVICE_Module_DBG >= 5
  SCDEFn_at_ESP32_DeVICE_M->Log3Fn(Common_Definition->name
	,Common_Definition->nameLen
	,5
	,"Executing ShutdownFn of Module '%.*s' for Definition '%.*s'."
	,ESP32_DeVICE_Definition->common.module->provided->typeNameLen
	,ESP32_DeVICE_Definition->common.module->provided->typeName
		,ESP32_DeVICE_Definition->common.nameLen
	,ESP32_DeVICE_Definition->common.name);
  #endif

// -------------------------------------------------------------------------------------------------

  // 8. Wi-Fi Deinit Phase

  // s8.1: Call esp_wifi_disconnect() to disconnect the Wi-Fi connectivity.
  esp_wifi_disconnect();

  // s8.2: Call esp_wifi_stop() to stop the Wi-Fi driver.
  esp_wifi_stop();

  // s8.3: Call esp_wifi_deinit() to unload the Wi-Fi driver.
  esp_wifi_deinit();

  return retMsg;
}



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_State
 *  Desc: FN is called when a Definition of this Module gets, and should set an state update. 
 *        Normally called from setstate cmd when executing state (=readings?) recovery from save .cfg
 *  Info: An FN for State in an Module is optional!
 *  Para: const Common_Definition_t *ESP32_DeVICE_Definition -> Definition that should execute an status update
 *        const time_t stateTiSt -> time stamp for status update / reading value
 *        const String_t stateNameString -> state Name for status update / reading value
 *        const String_t stateValueString -> state Value for the status update / reading value
 *        const String_t stateMimeString -> state Mime for the status update / reading value
 *  Rets: Entry_String_t* -> singly linked tail queue element which stores one xString_t string
 *                                  as response text in allocated memory. NULL=no response text
 * -------------------------------------------------------------------------------------------------
 */
Entry_String_t*
ESP32_DeVICE_State(Common_Definition_t *Common_Definition
	,const time_t stateTiSt
	,const String_t stateNameString
	,const String_t stateValueString
	,const String_t stateMimeString)
{
  // Fn return message. NULL = no return message
  Entry_String_t *retMsg_Entry_String = NULL;
	
  // make common ptr to modul specific ptr
  Entry_ESP32_DeVICE_Definition_t* ESP32_DeVICE_Definition =
		(Entry_ESP32_DeVICE_Definition_t*) Common_Definition;

// -------------------------------------------------------------------------------------------------

  #if ESP32_DeVICE_Module_DBG >= 5
  // prepare TiSt-string for LogFn
  strText_t timeString =
  	SCDEFn_at_ESP32_DeVICE_M->FmtDateTimeFn(stateTiSt);

  SCDEFn_at_ESP32_DeVICE_M->Log3Fn(Common_Definition->name
	,Common_Definition->nameLen
	,5
	,"Executing StateFn of Module '%.*s' for Definition '%.*s'. "
         "Should set State for '%.*s' with Value '%.*s' and Mime '%.*s'. TimeStamp '%.*s'."
	,ESP32_DeVICE_Definition->common.module->provided->typeNameLen
	,ESP32_DeVICE_Definition->common.module->provided->typeName
	,Common_Definition->nameLen
	,Common_Definition->name
	,stateNameString.len
	,stateNameString.p_char
	,stateValueString.len
	,stateValueString.p_char
	,stateMimeString.len
	,stateMimeString.p_char
	,timeString.strTextLen
	,timeString.strText);

