EcSUHA/ESP32_DeVICE_Module/ESP32_DeVICE_Module.c
  // free TiSt-string from LogFn
  free(timeString.strText);
  #endif

/*
// ------------------------------------------------------------------------------------------------

  // build an temp KEY=VALUE string
  xString_t argsString;

  // check if there is a KEY
  if (!stateNameString.length) {

	// alloc mem for the singly linked tail queue element that stores the Return Message
	retMsg_Entry_String = 
		malloc(sizeof(xMultipleStringSLTQE_t));

	// fill Return Message with error text
	retMsg_Entry_String->string.length = 
		asprintf(&retMsg_Entry_String->string.characters
			,"Error in StateFn! Fn called without State Name");

	return retMsg_Entry_String;
  }

  argsString.length = 
	asprintf(&argsString.characters
		,"%.*s=%.*s"
		,stateNameString.length
		,stateNameString.characters
		,stateValueString.length
		,stateValueString.characters);

// ------------------------------------------------------------------------------------------------

  // Parse State-Args (KEY=VALUE) protocol -> gets parsedKVInput in allocated mem, NULL = ERROR
  parsedKVInputArgs_t *parsedKVInput = 
	SCDEFn_at_ESP32_DeVICE_M->ParseKVInputArgsFn(ESP32_DeVICE_Set_NUMBER_OF_IK	// Num Implementated KEYs MAX
		,ESP32_DeVICE_Set_ImplementedKeys			// Implementated Keys
		,argsString.characters
		,argsString.length);

  // NULL? Parsing reports an problem. args contain: unknown keys, double keys, ...?
  if (!parsedKVInput) {

	// alloc mem for the singly linked tail queue element that stores the Return Message
	retMsg_Entry_String = 
		malloc(sizeof(xMultipleStringSLTQE_t));

	// fill Return Message with error text
	retMsg_Entry_String->string.length = 
		asprintf(&retMsg_Entry_String->string.characters
			,"Parsing Error! Args '%.*s' not taken! Check the KEYs!"
			,argsString.length
			,argsString.characters);

	// free the temp KEY=VALUE string
	if (argsString.characters) free (argsString.characters);

	return retMsg_Entry_String;
  }

// -------------------------------------------------------------------------------------------------

  // free allocated memory for query result key-field
  free(parsedKVInput);

  // free the temp KEY=VALUE string
  if (argsString.characters) free (argsString.characters);
*/
  return retMsg_Entry_String;
}



/** TEXT IST FALSCH!!!!!!!!!!
 * --------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_Undefine
 *  Desc: Removes the define of an "device" of 'WebIF' type. Contains devicespecific init code.
 *  Info: Invoked by cmd-line 'Undefine ESP32_DeVICE_Definition.common.Name'
 *  Para: Entry_ESP32_DeVICE_Definition_t *ESP32_DeVICE_Definition -> Definition that should be removed
 *  Rets: strTextMultiple_t* -> response text in allocated memory, NULL=no text
 * --------------------------------------------------------------------------------------------------
 */
strTextMultiple_t* ICACHE_FLASH_ATTR
ESP32_DeVICE_Undefine(Common_Definition_t* Common_Definition)
  {

  // for Fn response msg
  strTextMultiple_t *retMsg = NULL;

  // make common ptr to modul specific ptr
  Entry_ESP32_DeVICE_Definition_t* ESP32_DeVICE_Definition =
	(Entry_ESP32_DeVICE_Definition_t*) Common_Definition;

// -------------------------------------------------------------------------------------------------

  #if ESP32_DeVICE_Module_DBG >= 5
  SCDEFn_at_ESP32_DeVICE_M->Log3Fn(Common_Definition->name
		,Common_Definition->nameLen
		,5
		,"Executing UndefineFn of Module '%.*s' for Definition '%.*s'."
		,ESP32_DeVICE_Definition->common.module->provided->typeNameLen
		,ESP32_DeVICE_Definition->common.module->provided->typeName
		,ESP32_DeVICE_Definition->common.nameLen
		,ESP32_DeVICE_Definition->common.name);
  #endif

// -------------------------------------------------------------------------------------------------

  // response with error text

  // alloc mem for retMsg
  retMsg = malloc(sizeof(strTextMultiple_t));

  // response with error text
  retMsg->strTextLen = asprintf(&retMsg->strText
	,"ESP32_DeVICE_Set, Name:%.*s"
	,ESP32_DeVICE_Definition->common.nameLen
	,ESP32_DeVICE_Definition->common.name);

  return retMsg;
}



/*
 * --------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_WiFiEventHandler
 *  Desc: Wifi event handler
 *  Para: System_Event_t *event -> struct with incoming event information for wifi
 *  Rets: -/-
 * --------------------------------------------------------------------------------------------------
 */
static esp_err_t
ESP32_DeVICE_WiFiEventHandler(void *ctx, system_event_t *event)
{
  switch (event->event_id)

	{

//--------------------------------------------------------------------------------------------------

	// ESP32 WiFi ready
	case SYSTEM_EVENT_WIFI_READY:

	break;

//--------------------------------------------------------------------------------------------------

	// ESP32 finish scanning AP
	case SYSTEM_EVENT_SCAN_DONE:

	// struct contains:
  	// uint32_t status;          /**< status of scanning APs */
  	// uint8_t  number;
  	// uint8_t  scan_id;
	// system_event_sta_scan_done_t;

	break;

//--------------------------------------------------------------------------------------------------

	// ESP32 station start
	case SYSTEM_EVENT_STA_START:

	// station started - connect to station
	esp_wifi_connect();

	break;

//--------------------------------------------------------------------------------------------------

	// ESP32 station stop
	case SYSTEM_EVENT_STA_STOP:

	break;

//--------------------------------------------------------------------------------------------------

	// ESP32 station connected to AP
	case SYSTEM_EVENT_STA_CONNECTED:

	// struct contains:
   	// uint8_t ssid[32];         /**< SSID of connected AP */
   	// uint8_t ssid_len;         /**< SSID length of connected AP */
   	// uint8_t bssid[6];         /**< BSSID of connected AP*/
   	// uint8_t channel;          /**< channel of connected AP*/
   	// wifi_auth_mode_t authmode;
	// system_event_sta_connected_t;

