EcSUHA/ESP32_DeVICE_Module/ESP32_DeVICE_Module.c
      char strftime_buf[64];

      // Set timezone to Eastern Standard Time and print local time
         setenv("TZ", "EST5EDT,M3.2.0/2,M11.1.0", 1);
         tzset();
         localtime_r(&now, &timeinfo);
         strftime(strftime_buf, sizeof(strftime_buf), "%c", &timeinfo);
         LOGD("New York is: %s"
        	,strftime_buf);
*/

 




















/*
 * ------------------  helpers provided for module operation starting here ------------------------
 */



// eine für Set und eine für define ????

/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_DeVICE_ProcessKVInputArgs
 *  Desc: Processes the KEY=VALUE input from Args. Information is pre-parsed to *parsedKVInput
 *  Info: .requiredKV -> Keys that should be there / .forbiddenKV -> Keys that are not allowed
 *  Para: Entry_ESP32_DeVICE_Definition_t *ESP32_DeVICE_Definition -> Definition that should get the input
 *        parsedKVInputArgs_t *parsedKVInput -> ptr to allocated mem filled with results from parse
 *        uint8_t *argsText -> the ArgsText
 *        size_t argsTextLen -> length of the ArgsText
 *  Rets: Bool -> TRUE = input parsed successful, FALSE = input parsed, but NOT successful, CANCELED
 * -------------------------------------------------------------------------------------------------
 */
bool
ESP32_DeVICE_ProcessKVInputArgs(Entry_ESP32_DeVICE_Definition_t *ESP32_DeVICE_Definition
	,parsedKVInputArgs_t *parsedKVInput
	,uint8_t *argsText
	,size_t argsTextLen)
{



printf ("The Args: '%.*s'.",argsTextLen,argsText);



// -------------------------------------------------------------------------------------------------
// 1. Step: Create backup structures, if required mirror current values from SDK
// -------------------------------------------------------------------------------------------------

  // block #01 mirror 'wifi_config_t' (WSAP-Configuration)
  wifi_config_t ap_wifi_config;
  if (parsedKVInput->keysFoundBF & 
				( (1 << ESP32_DeVICE_Set_IK_Name)
				| (1 << ESP32_DeVICE_Set_IK_WSAP_Password)
				| (1 << ESP32_DeVICE_Set_IK_WSAP_RF_Channel)
				| (1 << ESP32_DeVICE_Set_IK_WSAP_Maximal_Connections)
				| (1 << ESP32_DeVICE_Set_IK_WSAP_Authentication_Method)
				| (1 << ESP32_DeVICE_Set_IK_WSAP_SSID_Visibility)
				| (1 << ESP32_DeVICE_Set_IK_WSAP_Beacon_Interval) ) ) {

	esp_wifi_get_config (WIFI_IF_AP, &ap_wifi_config);
  }

// -------------------------------------------------------------------------------------------------






  // Processed block #02 mirror 'tcpip_adapter_ip_info_t' (WSAP-IP-Settings)
  tcpip_adapter_ip_info_t ap_ip_info;
  if (parsedKVInput->keysFoundBF &  ( ESP32_DeVICE_R_WSAP_IP_Adress
				    | ESP32_DeVICE_R_WSAP_Netmask
				    | ESP32_DeVICE_R_WSAP_Gateway_Adress) ) {

	tcpip_adapter_get_ip_info(TCPIP_ADAPTER_IF_AP, &ap_ip_info);
  }

// -------------------------------------------------------------------------------------------------

  // block #3 get current Service AP MAC Adress
  uint8_t ap_mac_addr[8];
  esp_wifi_get_mac(WIFI_IF_AP,(uint8_t *) &ap_mac_addr);

  // block #4 get the bandwith of the Service Access Point
  wifi_bandwidth_t ap_wifi_bandwidth;
  esp_wifi_get_bandwidth(WIFI_IF_AP, &ap_wifi_bandwidth);

  // block #5 get the WiFi Country
  wifi_country_t country;
  esp_wifi_get_country(&country);

  // block #6 get current Station IP Settings
  tcpip_adapter_ip_info_t sta_ip_info;
  tcpip_adapter_get_ip_info(TCPIP_ADAPTER_IF_STA, &sta_ip_info);

  // block #7 get current Station MAC Adress
  uint8_t sta_mac_addr[8];
  esp_wifi_get_mac(WIFI_IF_STA, (uint8_t *) &sta_mac_addr);

  // block #8 get current Station Auto-Connect-Status
  bool sta_autoconnect_status;
 // esp_wifi_get_auto_connect(&sta_autoconnect_status);

 // block #9 mirror 'wifi_bandwidth_t' (WIFI STA Configuration)
  wifi_bandwidth_t wifiBandwidthSTA;
  if (parsedKVInput->keysFoundBF & (1 << ESP32_DeVICE_R_WSAP_WiFi_Bandwidth) ) {

	esp_wifi_get_bandwidth(WIFI_IF_STA, &wifiBandwidthSTA);
  }










//#3
  // block #6 get current Station Settings
  wifi_config_t sta_wifi_config;
  esp_wifi_get_config (WIFI_IF_STA, &sta_wifi_config);

  // block #3 get current Service AP DHCP-Server-Status
  tcpip_adapter_dhcp_status_t ap_dhcp_status;
  tcpip_adapter_dhcps_get_status(TCPIP_ADAPTER_IF_AP,&ap_dhcp_status); 
//esp_err_t tcpip_adapter_dhcps_stop(tcpip_adapter_if_t tcpip_if);
//esp_err_t tcpip_adapter_dhcps_start(tcpip_adapter_if_t tcpip_if);

  // block #8 get current Station DHCP-Client-Status
  tcpip_adapter_dhcp_status_t sta_dhcp_status;
  tcpip_adapter_dhcpc_get_status(TCPIP_ADAPTER_IF_STA,&sta_dhcp_status); 
//esp_err_t tcpip_adapter_dhcpc_start(tcpip_adapter_if_t tcpip_if);
//esp_err_t tcpip_adapter_dhcpc_stop(tcpip_adapter_if_t tcpip_if);



/*

  // block #13 mirror 'wifi_mode_t' (WIFI WSAP+STA Configuration)
  wifi_mode_t wifi_mode;
  if (parsedKVInput->keysFoundBF & (1 << ESP32_DeVICE_Set_IK_?) ) {

	esp_wifi_get_mode(&wifi_mode);
  }

  // block #xx mirror 'wifi_ps_type_t' (WIFI WSAP+STA Configuration)
  wifi_ps_type_t wifi_ps_type;
  if (parsedKVInput->keysFoundBF & (1 << ESP32_DeVICE_Set_IK_?) ) {

	esp_wifi_set_ps(&wifi_ps_type);
  }

  // block #xx mirror 'protocol_bitmap' (WIFI WSAP Configuration)
  uint8_t protocolBitmapAP;
  if (parsedKVInput->keysFoundBF & (1 << ESP32_DeVICE_Set_IK_?) ) {

	esp_wifi_get_protocol(TCPIP_ADAPTER_IF_AP, &protocolBitmapAP);
  }

  // block #xx mirror 'protocol_bitmap' (WIFI STA Configuration)
  uint8_t protocolBitmapSTA;
  if (parsedKVInput->keysFoundBF & (1 << ESP32_DeVICE_Set_IK_?) ) {

	esp_wifi_get_protocol(TCPIP_ADAPTER_IF_STA, &protocolBitmapSTA);
  }

 // block #xx mirror 'wifi_bandwidth_t' (WIFI WSAP Configuration)
  wifi_bandwidth_t wifiBandwidthSTA;
  if (parsedKVInput->keysFoundBF & (1 << ESP32_DeVICE_R_STA_WiFi_Bandwidth) ) {

	esp_wifi_get_bandwidth(WIFI_IF_STA, &wifiBandwidthSTA);
  }
*/






