EcSUHA/ESP32_DeVICE_Module/ESP32_DeVICE_Module.c
	// initial setup / correction of the SDK parameters
	SCDE_SDKInitialParameterSetup();

	// fresh start
	system_restart();

  }
*/
//--------------------------------------------------------------------------------------------------

  // SoCHW_Factory_Reset_CAPI=[ ] -> Setzt die SoC-Hardware-Chip-API auf Werkseinstellung zurück 'factory reset'
  // SoCHW_Factory_Reset_CAPI=[ ] -> Set SoC-Hardware-Chip-API to state 'factory reset'

  if (parsedKVInput->keysFoundBF & (uint64_t) 1 << ESP32_DeVICE_Set_IK_SoCHW_Factory_Reset_CAPI) {

	// restore SDK parameters (SDK-factory reset)
//	system_restore();

//	SCDE_ReconstructSysCfgRomNoMirror();		// todo
//	SCDE_ReconstructSysCfgRamNoMirror();		// reconstruct Sys-Cfg stored in ram (done by reboot)
//	SCDE_ReconstructSysCfgRamFlashMirrored();	// reconstruct Sys-Cfg stored in ram (flash-mirrored) 
//	SCDE_ReconstructSysCfgRamRtcMirrored();		// reconstruct Sys-Cfg stored in rtc

	// initial setup / correction of the SDK parameters
//	SCDE_SDKInitialParameterSetup();

	// fresh start
//	system_restart();

  }

//--------------------------------------------------------------------------------------------------

  // SoCHW_Factory_Reset_CAPI=[ ] -> Setzt die SoC-Hardware-Chip-API auf Werkseinstellung zurück 'factory reset'
  // SoCHW_Factory_Reset_CAPI=[ ] -> Set SoC-Hardware-Chip-API to state 'factory reset'

  if (parsedKVInput->keysFoundBF & (uint64_t) 1 << ESP32_DeVICE_Set_IK_SoCHW_Factory_Reset) {

	// restore SDK parameters (SDK-factory reset)
//	system_restore();

	// initial setup / correction of the SDK parameters
//	SCDE_SDKInitialParameterSetup();

	// fresh start
//	system_restart();

  }

//>Caps Bit n.a.------------------------------------------------------------------------------------

  // name=[a-zA-Z0-9_.] -> Setze einen neuen Feature Namen (char[31]) (0-x)
  // name=[a-zA-Z0-9_.] -> Set a new Feature Name (char[31]) (0-x)
/*
  if (parsedKVInput->keysFoundBF & (uint64_t) 1 << ESP32_DeVICE_Set_IK_Name) {

  }
*/
//>Caps Bit n.a.------------------------------------------------------------------------------------

  // caps=[ ] -> Fragt nach den Fähigkeiten-Bits (0-x)
  // caps=[ ] -> Request for Capabilities-Bits (0-x)
/*
  if (parsedKVInput->keysFoundBF & (uint64_t) 1 << ESP32_DeVICE_Set_IK_caps) {

	// mark affected readings for TX
	affectedReadings |= parsedKVInput->keyData_t[ESP32_DeVICE_Set_IK_caps].affectedReadings;

	// New Timestamp
//	WriteInt32toSysCfgRamRtcMirrored(&SysCfgRamRtcMirrored->MySCDE_FeatCfgRamRtcMirrored_M1[ADID].IB01_X_TiSt,
//		GetUniqueTIST());
//bug in anderem code

	// Push processed CMD to to Response ...
//	RespArgsWPos += os_sprintf( RespArgsWPos,"cmd=caps");

  }
*/

















// ------------------------------------------------------------------------------------------------

// 3. Step: Check if the ammount of input elements meets our criteria

  // check if all required Key=Value components are included -> return with FALSE
  if ( (parsedKVInput->keysFoundBF & parsedKVInput->requiredKVBF) != parsedKVInput->requiredKVBF) {

	#if ESP32_SwITCH_Module_DBG >= 5
	printf("|requiredKVBF, no match!>");	
  	#endif

	return true;
  }

  // check if forbidden Key=Value components are included -> return with FALSE
  if (parsedKVInput->keysFoundBF & parsedKVInput->forbiddenKVBF) {

	#if ESP32_SwITCH_Module_DBG >= 5
	printf("|forbiddenKVBF, match!>");	
  	#endif

	return true;
  }

// -------------------------------------------------------------------------------------------------
// 4. Step: Passed. Store the new values to SDK
// -------------------------------------------------------------------------------------------------
/*

  // block #01 readings, store ap_wifi_config (WSAP-Wifi-Configuration), then save & set
  if (parsedKVInput->keysFoundBF & ( (1 << ESP32_DeVICE_Set_IK_Name)
				   | (1 << ESP32_DeVICE_Set_IK_WSAP_Password)
				   | (1 << ESP32_DeVICE_Set_IK_WSAP_RF_Channel)
				   | (1 << ESP32_DeVICE_Set_IK_WSAP_Maximal_Connections)
				   | (1 << ESP32_DeVICE_Set_IK_WSAP_Authentication_Method)
				   | (1 << ESP32_DeVICE_Set_IK_WSAP_SSID_Visibility)
				   | (1 << ESP32_DeVICE_Set_IK_WSAP_Beacon_Interval) ) ) {

	# if ESP32_SwITCH_Module_DBG >= 5
	SCDEFn_at_ESP32_DeVICE_M->HexDumpOutFn ("WSAP: ap_wifi_config changed !",
		&ap_wifi_config,
		sizeof(ap_wifi_config));
	# endif

	// store length of ssid (may be changed)
	ap_wifi_config.ap.ssid_len = 
		strlen((char*)&ap_wifi_config.ap.ssid);

	// Set new WSAP Cfg
	esp_wifi_set_config(WIFI_IF_AP, &ap_wifi_config);

	// Set new Hostname
	tcpip_adapter_set_hostname(TCPIP_ADAPTER_IF_AP, (const char *) &ap_wifi_config.ap.ssid);
  }
*/
// -------------------------------------------------------------------------------------------------



























/*
// =================================================================================================
// =================================================================================================
// =================================================================================================

// -------------------------------------------------------------------------------------------------
// Save changes to SDK
// -------------------------------------------------------------------------------------------------

  // Processed block #01 readings, that affects ap_wifi_config (WSAP-Wifi-Configuration) ? then save & set
  if (affectedReadings & ( ESP32_DeVICE_R_Name
			| ESP32_DeVICE_R_WSAP_Password
			| ESP32_DeVICE_R_WSAP_RF_Channel
			| ESP32_DeVICE_R_WSAP_Maximal_Connections
			| ESP32_DeVICE_R_WSAP_Authentication_Method
			| ESP32_DeVICE_R_WSAP_SSID_Visibility
			| ESP32_DeVICE_R_WSAP_Beacon_Interval) ) {

	# if SCDE_WIFI_DBG >= 5
	HexDumpOut ("WSAP ap_wifi_config ch!",
		&ap_wifi_config,
		sizeof(ap_wifi_config));
	# endif

