EcSUHA/ESP32_DeVICE_Module/ESP32_DeVICE_Module.c
	// store length of ssid (may be changed)
	ap_wifi_config.ap.ssid_len = 
		strlen((char*)&ap_wifi_config.ap.ssid);

	// Set new WSAP Cfg
	esp_wifi_set_config (WIFI_IF_AP, &ap_wifi_config);

	// Set new Hostname
	tcpip_adapter_set_hostname(TCPIP_ADAPTER_IF_AP, (const char *) &ap_wifi_config.ap.ssid);

  }

// -------------------------------------------------------------------------------------------------

   // Processed block #02 readings, that affects AP_ip_info (WSAP-Ip-Info) ? then save & set
  if (affectedReadings & ( ESP32_DeVICE_R_WSAP_IP_Adress
			| ESP32_DeVICE_R_WSAP_Netmask
			| ESP32_DeVICE_R_WSAP_Gateway_Adress) ) {

	# if SCDE_WIFI_DBG >= 5
	HexDumpOut ("WSAP ip_info ch!",
		&ap_ip_info,
		sizeof(ap_ip_info));
	# endif

	// Set new AP IP INFO
	tcpip_adapter_set_ip_info(TCPIP_ADAPTER_IF_AP, &ap_ip_info);

  }

// -------------------------------------------------------------------------------------------------

  // Processed block #03 readings, that affects ap_mac_addr (WSAP-MAC-Adress) ? then save & set
  if (affectedReadings & ( ESP32_DeVICE_R_WSAP_MAC_Adress ) ) {

	# if SCDE_WIFI_DBG >= 5
	HexDumpOut ("WSAP mac_addr ch!",
		&ap_mac_addr,
		sizeof(ap_mac_addr));
	# endif

	// Set new AP macaddr
	esp_wifi_set_mac(WIFI_IF_AP,(uint8_t *) &ap_mac_addr);

  }

// -------------------------------------------------------------------------------------------------

  // Processed block #04 readings, that affects ap_wifi_bandwidth (WSAP-WiFi-Bandwidth) ? then save & set
  if (affectedReadings & ( ESP32_DeVICE_R_WSAP_WiFi_Bandwidth ) ) {

	// Set new AP wifi_bandwidth
	esp_wifi_set_bandwidth(WIFI_IF_AP, ap_wifi_bandwidth);

  }

// -------------------------------------------------------------------------------------------------

  // Processed block #05 readings, that affects country WiFi-Country) ? then save & set
  if (affectedReadings & ( ESP32_DeVICE_R_WiFi_Country ) ) {

	// Set new WiFi country
	esp_wifi_set_country(&country);

  }

// -------------------------------------------------------------------------------------------------

  // Processed block #06 readings, that affects sta_ip_info (Station-Ip-Info) ? then save & set
  if (affectedReadings & ( ESP32_DeVICE_R_Station_IP_Adress
			|ESP32_DeVICE_R_Station_Netmask
			|ESP32_DeVICE_R_Station_Gateway_Adress ) ) {

	# if SCDE_WIFI_DBG >= 5
	HexDumpOut ("STA ip_info ch!",
		&sta_ip_info,
		sizeof(sta_ip_info));
	# endif

	// Set new STA ip_info
	tcpip_adapter_set_ip_info(TCPIP_ADAPTER_IF_STA, &sta_ip_info);

  }

// -------------------------------------------------------------------------------------------------

  // Processed block #07 readings, that affects sta_mac_addr (Station-MAC-Adress) ? then save & set
  if (affectedReadings & ( ESP32_DeVICE_R_Station_MAC_Adress ) ) {

	# if SCDE_WIFI_DBG >= 5
	HexDumpOut ("STA mac_addr ch!",
		&sta_mac_addr,
		sizeof(sta_mac_addr));
	# endif

	// Set new AP macaddr
	esp_wifi_set_mac(WIFI_IF_STA,(uint8_t *) &sta_mac_addr);

  }

// -------------------------------------------------------------------------------------------------

  // Processed block #08 readings, that affects sta_autoconnect_status (Station_Auto_Connect) ? then save & set
  if (affectedReadings & ( ESP32_DeVICE_R_Station_Auto_Connect ) ) {

	// Set new auto-connect-status
	esp_wifi_set_auto_connect(sta_autoconnect_status);

  }

// -------------------------------------------------------------------------------------------------

  // Processed block #09 readings, that affects sta_wifi_bandwidth (Station-WiFi-Bandwidth) ? then save & set
  if (affectedReadings & ( ESP32_DeVICE_R_Station_WiFi_Bandwidth ) ) {

	// Set new station bandwidth
	esp_wifi_set_bandwidth(WIFI_IF_STA, sta_wifi_bandwidth);

  }

// -------------------------------------------------------------------------------------------------

*/









/*
  // Processed block #03 readings, that affects AP_dhcps_lease (Service-Access-Point-Configuration) ? then save & set
  if (affectedReadings & ( SCDE_R_WSAP_DHCPS_Lease_Start_IP
			| SCDE_R_WSAP_DHCPS_Lease_End_IP
			| SCDE_R_WSAP_IP_Adress) ) {

	# if SCDE_WIFI_DBG >= 5
	HexDumpOut ("WSAP dhcps_lease ch!",
		&dhcps_lease,
		sizeof(dhcps_lease));
	# endif

	// Set new AP dhcps_lease
	wifi_softap_set_dhcps_lease(&dhcps_lease);

	// set new DHCPS Status
	if (WifiSoftAPDHCPSStatus) tcpip_adapter_dhcpc_start(WIFI_IF_AP);
	else tcpip_adapter_dhcpc_stop(WIFI_IF_AP);

	}
*/



/*  // block #5 get the bandwith of the Service Access Point
  wifi_bandwidth_t ap_wifi_bandwidth;
  esp_wifi_get_bandwidth(WIFI_IF_AP, &ap_wifi_bandwidth);

  // block #6 get current Station Settings
  wifi_config_t sta_wifi_config;
  esp_wifi_get_config (WIFI_IF_STA, &sta_wifi_config);*/



/*
  // Processed block 05 readings, that affects AP dhcps status (Service-Access-Point-Configuration) ? then save & set
  if (affectedReadings & ( SCDE_R_WSAP ) )

	{

	// Set new AP opmode
	esp_wifi_set_mode( (esp_wifi_get_mode() & 0b01) | (WifiApOpMode << 1) );

	}
*/






/*
 // Processed block 07 readings, that affects STA opmode (Station-Configuration) ? then save & set
  if (affectedReadings & ( SCDE_R_Station ) )

	{

	// Set new AP opmode
 	//  int WifiStaOpMode = (wifi_get_opmode() & 0b01);

	}


  // Processed block 08 readings, that affects STA dhcp (Station-Configuration) ? then save & set
  if (affectedReadings & ( SCDE_R_Station_DHCP ) )

	{

	// Set new ?
 	//  int WifiStationDHCPStatus = wifi_station_dhcpc_status();

	tcpip_adapter_dhcps_start(tcpip_adapter_if_t tcpip_if);
	tcpip_adapter_dhcps_stop(tcpip_adapter_if_t tcpip_if);
	}


  // Processed block 9 readings, that affects STA auto connect status (Station-Configuration) ? then save & set
  if (affectedReadings & ( SCDE_R_Station_Auto_Connect ) )

	{

	// Set new STA auto connect status
 	//wifi_station_set_auto_connect(WifiStationAutoConnectStatus);

